{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### **Candidate Number: 48372**  \n",
    "### This Notebook is for providing answers to Question 2 (Neo4j Part) Only"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### **Question (A)/(2A)**\n",
    "#### I have used the **arrows.app** to create a schematic diagram to visualise my graph database. Please check the file named \"48372_Q(2A)_Arrows.app_schematic_graph\" in the repository. However, the actual database creation is done in neo4j with the following code:"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### A.1 Connect to neo4j with my credentials."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "uri = \"neo4j+s://7c16e671.databases.neo4j.io\"\n",
    "username = \"neo4j\"\n",
    "password = \"Jm7W7Cxq1FcCtMq9OCUNRviXs4gmOFtrm5ky1WBQ1Zs\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### A.2 Refring to the 1st assignment, create Constraints.\n",
    "##### Note: when creating Constraints, there is no need to create properties at this stage, because I will modify properties when populating the data. But I do wish to specify Unique Identifiers for each table now."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "class SetupConstraints:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "    def create_constraints(self):\n",
    "        with self.driver.session() as session:\n",
    "            session.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (c:Customer) REQUIRE c.email IS UNIQUE\")\n",
    "            session.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (o:Order) REQUIRE o.order_number IS UNIQUE\")\n",
    "            session.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (pm:PaymentMethod) REQUIRE pm.payment_method_id IS UNIQUE\")\n",
    "            session.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (cc:CreditCard) REQUIRE cc.credit_card_id IS UNIQUE\")\n",
    "            session.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (gc:GiftCard) REQUIRE gc.gift_card_id IS UNIQUE\")\n",
    "            session.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (cat:Category) REQUIRE cat.category_id IS UNIQUE\")\n",
    "            session.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (w:Wishlist) REQUIRE w.wishlist_id IS UNIQUE\")\n",
    "            session.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (d:Delivery) REQUIRE d.track_number IS UNIQUE\")\n",
    "            session.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (r:Return) REQUIRE r.ticket_number IS UNIQUE\")\n",
    "            session.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (p:Product) REQUIRE p.product_number IS UNIQUE\")\n",
    "            session.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (rev:Review) REQUIRE rev.review_number IS UNIQUE\")\n",
    "            session.run(\"CREATE CONSTRAINT IF NOT EXISTS FOR (oi:OrderedItem) REQUIRE oi.ordered_item_id IS UNIQUE\")\n",
    "\n",
    "setup = SetupConstraints(uri, username, password)\n",
    "setup.create_constraints()\n",
    "setup.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### **Question (B)/(2B)**\n",
    "#### In this section I will populate the data into the neo4j graph database. All data is hardcoded. The procedure to populate each table is the same.  Basicly it could be divided into 2 parts: **inserting data and creating relationships**.  \n",
    " \n",
    "##### Both data insertion and relationship-building are done by this function **populate_xxx**. Inside this function I will include a list of data that I moved from my 1st assignment, which also includes corresponding foreign keys if there is any. This is because I will need to use them in building relationships between tables. \n",
    "\n",
    "##### As for building relationships, I use **session.run**, which starts a cypher query. Inside the query, I use **MERGE** to create new nodes, this was done by searching **unique identifiers**. Because they are unique, they should never duplicate (but if there is duplication then the MERGE clause will detect and stop creating new ones). And when nodes are created, I can use **ON CREATE SET** to insert the rest of properties into nodes."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### B.1 Populate Entity Customer"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "class PopulateCustomers:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "    def populate_customers(self):\n",
    "        customers = [\n",
    "            ('jane.smith@outlook.com', 'sdc789a2sc', 'Jane Smith', '1990-08-25', '0987654321', 'Canada', 'Toronto', 'Queen St', 'Suite 202', 'M5H 2N2'),\n",
    "            ('alice.jones@gmail.com', 'sd89a5c33sc', 'Alice Jones', '1988-03-12', '1122334455', 'UK', 'London', 'Baker St', 'Flat 3B', 'NW1 6XE'),\n",
    "            ('bob.brown@outlook.com', 'asd787asdc2', 'Bob Brown', '1975-07-30', '6677889900', 'Australia', 'Sydney', 'George St', 'Unit 5', '2000'),\n",
    "            ('carol.white@outlook.com', 'adeeewc455a', 'Carol White', '1995-11-20', '5566778899', 'Germany', 'Berlin', 'Alexanderplatz', 'Apt 12', '10178'),\n",
    "            ('laura.green@gmail.com', 'gfhuyb34fgh', 'Laura Green', '1989-01-05', '2233445566', 'USA', 'Los Angeles', 'Sunset Blvd', 'Apt 45', '90028'),\n",
    "            ('chris.lee@outlook.com', 'w3egbbte4', 'Chris Lee', '1984-10-15', '9988776655', 'Canada', 'Vancouver', 'Main St', 'Suite 203', 'V6A 2B1'),\n",
    "            ('emily.davis@gmail.com', 'h56frtfdc', 'Emily Davis', '1992-12-08', '3344556677', 'UK', 'Manchester', 'King St', 'Flat 9', 'M2 4LQ'),\n",
    "            ('michael.jordan@yahoo.com', 'tvg45ty89', 'Michael Jordan', '1978-04-23', '4455667788', 'Australia', 'Melbourne', 'Collins St', 'Unit 12', '3000'),\n",
    "            ('susan.martin@hotmail.com', 'r4gtre2rf', 'Susan Martin', '1993-06-10', '6677889901', 'Germany', 'Hamburg', 'Reeperbahn', 'Apt 18', '20359'),\n",
    "            ('robert.jones@aol.com', 'a5trfgre12', 'Robert Jones', '1982-02-28', '2233445567', 'USA', 'Chicago', 'Michigan Ave', 'Apt 21', '60611'),\n",
    "            ('nancy.parker@gmail.com', 'ae4htrgre', 'Nancy Parker', '1996-09-16', '1231231234', 'Canada', 'Montreal', 'Saint Laurent Blvd', 'Suite 506', 'H2X 1V4'),\n",
    "            ('kevin.baker@gmail.com', '3gter5regr', 'Kevin Baker', '1987-12-04', '9988771122', 'UK', 'Liverpool', 'Bold St', 'Flat 4B', 'L1 4DN'),\n",
    "            ('patricia.scott@yahoo.com', 'yh3rrf34y', 'Patricia Scott', '1979-03-29', '7766554433', 'Australia', 'Brisbane', 'Queen St', 'Unit 5', '4000'),\n",
    "            ('thomas.anderson@outlook.com', 'qr5ttv44e', 'Thomas Anderson', '1983-11-12', '5566778822', 'Germany', 'Munich', 'Maximilianstr', 'Apt 6', '80539'),\n",
    "            ('diana.king@hotmail.com', 'yr43tg34', 'Diana King', '1994-05-07', '3344553322', 'France', 'Paris', 'Champs-Élysées', 'Flat 11A', '75008'),\n",
    "            ('mark.adams@gmail.com', 'tv45gre54t', 'Mark Adams', '1985-06-19', '6677884455', 'Italy', 'Rome', 'Via Veneto', 'Apt 4', '00187'),\n",
    "            ('gloria.williams@aol.com', 'at34rger', 'Gloria Williams', '1990-03-15', '3322115566', 'Spain', 'Madrid', 'Gran Via', 'Suite 301', '28013'),\n",
    "            ('ryan.carter@gmail.com', 'gr43gt5gr', 'Ryan Carter', '1976-08-03', '7766552211', 'Portugal', 'Lisbon', 'Rua Augusta', 'Unit 8', '1100-048'),\n",
    "            ('kimberly.allen@gmail.com', 'er43tr34t', 'Kimberly Allen', '1995-10-21', '3344557788', 'Netherlands', 'Amsterdam', 'Damrak', 'Apt 17', '1012'),\n",
    "            ('sara.watson@outlook.com', 'qt44rgre', 'Sara Watson', '1992-07-30', '6655443322', 'Sweden', 'Stockholm', 'Gamla Stan', 'Flat 3', '11129'),\n",
    "            ('frank.harris@gmail.com', 'gre34rt43', 'Frank Harris', '1980-04-14', '2233445568', 'Denmark', 'Copenhagen', 'Nørregade', 'Suite 22', '1165'),\n",
    "            ('matthew.reed@hotmail.com', '4trrg43t', 'Matthew Reed', '1988-09-25', '7766554499', 'Norway', 'Oslo', 'Karl Johans Gate', 'Apt 5', '0164'),\n",
    "            ('julia.moore@gmail.com', 'qtr5t4grr', 'Julia Moore', '1991-01-11', '3344552233', 'Switzerland', 'Zurich', 'Bahnhofstrasse', 'Flat 9B', '8001'),\n",
    "            ('philip.evans@yahoo.com', 'wq23r4tf', 'Philip Evans', '1986-02-20', '4455668822', 'Belgium', 'Brussels', 'Avenue Louise', 'Unit 10', '1050'),\n",
    "            ('oliver.taylor@gmail.com', 'qwef34gtr', 'Oliver Taylor', '1993-06-15', '9988772211', 'Finland', 'Helsinki', 'Esplanadi', 'Suite 14', '00130'),\n",
    "            ('hannah.collins@aol.com', 'wqt43rgt', 'Hannah Collins', '1989-12-20', '5544336677', 'Ireland', 'Dublin', 'OConnell Street', 'Apt 7', 'D01'),\n",
    "            ('timothy.hall@gmail.com', 'rtg45tgr3', 'Timothy Hall', '1975-03-03', '4433221100', 'Austria', 'Vienna', 'Kärntner Strasse', 'Flat 15C', '1010'),\n",
    "            ('anne.wilson@hotmail.com', 'tr34yt43', 'Anne Wilson', '1987-07-04', '2233445599', 'New Zealand', 'Wellington', 'Lambton Quay', 'Suite 101', '6011'),\n",
    "            ('elizabeth.james@gmail.com', '3tg4rger', 'Elizabeth James', '1991-10-30', '1231239988', 'Singapore', 'Singapore', 'Orchard Road', 'Apt 12A', '238840'),\n",
    "            ('steven.wright@outlook.com', 'h45grrt34', 'Steven Wright', '1984-09-17', '9988775533', 'South Korea', 'Seoul', 'Gangnam St', 'Unit 6', '06236'),\n",
    "            ('maria.hill@gmail.com', 'tgr34tre4', 'Maria Hill', '1982-05-08', '3344551199', 'Japan', 'Tokyo', 'Shibuya', 'Suite 15', '150-0002'),\n",
    "            ('henry.young@gmail.com', 'r4tger45g', 'Henry Young', '1992-11-13', '6677889902', 'China', 'Beijing', 'Wangfujing St', 'Flat 23', '100006'),\n",
    "            ('daniel.clark@yahoo.com', '4tgger54r', 'Daniel Clark', '1979-04-21', '1122334456', 'Russia', 'Moscow', 'Tverskaya St', 'Apt 2', '125009'),\n",
    "            ('isabella.hernandez@gmail.com', 'gtrf4grt4', 'Isabella Hernandez', '1995-02-06', '6655449988', 'Brazil', 'Rio de Janeiro', 'Copacabana', 'Unit 7', '22070-002'),\n",
    "            ('victoria.mitchell@gmail.com', 'grt4gr35', 'Victoria Mitchell', '1986-12-09', '4433221101', 'Argentina', 'Buenos Aires', 'Avenida 9 de Julio', 'Apt 8', 'C1043'),\n",
    "            ('aaron.morris@yahoo.com', 'qtr5gtr', 'Aaron Morris', '1989-07-22', '2233445577', 'South Africa', 'Cape Town', 'Long Street', 'Suite 19', '8001'),\n",
    "            ('joseph.cook@gmail.com', 'tgr43ytr', 'Joseph Cook', '1983-10-03', '6677881133', 'Israel', 'Tel Aviv', 'Dizengoff St', 'Flat 12', '63117'),\n",
    "            ('megan.foster@outlook.com', 'tre43tgr', 'Megan Foster', '1994-05-18', '9988773355', 'Mexico', 'Mexico City', 'Reforma', 'Unit 4B', '06600'),\n",
    "            ('michael.brown@gmail.com', 'gtrt4fgt', 'Michael Brown', '1985-02-15', '6677889903', 'USA', 'San Francisco', 'Market St', 'Apt 5B', '94103')\n",
    "        ]\n",
    "        \n",
    "        with self.driver.session() as session:\n",
    "            for c in customers:\n",
    "                session.run(\n",
    "                    \"\"\"\n",
    "                    MERGE (cust:Customer {email:$email})\n",
    "                    ON CREATE SET cust.password=$password, cust.name=$name, cust.birthdate=$birthdate,\n",
    "                                  cust.phonenumber=$phonenumber, cust.country=$country, cust.city=$city,\n",
    "                                  cust.street=$street, cust.building_info=$building_info, cust.postcode=$postcode\n",
    "                    \"\"\",\n",
    "                    email=c[0], password=c[1], name=c[2], birthdate=c[3], phonenumber=c[4], \n",
    "                    country=c[5], city=c[6], street=c[7], building_info=c[8], postcode=c[9]\n",
    "                )\n",
    "\n",
    "cust_pop = PopulateCustomers(uri, username, password)\n",
    "cust_pop.populate_customers()\n",
    "cust_pop.close()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### B.2 Populate Entity Order"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "class PopulateOrders:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "    def populate_orders(self):\n",
    "        orders = [\n",
    "            (1, '2024-01-15', '5%', '699.99,799.99', 1499.98, 1421.98, 'john.doe@gmail.com'),\n",
    "            (2, '2024-02-20', '10%', '1299.99,99.99', 1399.98, 1259.98, 'jane.smith@outlook.com'),\n",
    "            (3, '2024-03-10', '0%', '199.99,299.99', 499.98, 499.98, 'alice.jones@gmail.com'),\n",
    "            (4, '2024-04-25', '15%', '79.99,399.99', 479.98, 407.98, 'bob.brown@outlook.com'),\n",
    "            (5, '2024-05-30', '0%', '178.99,49.99', 228.98, 228.98, 'carol.white@outlook.com'),\n",
    "            (6, '2024-06-15', '20%', '1299.99,59.97', 1359.96, 1087.97, 'laura.green@gmail.com'),\n",
    "            (7, '2024-07-22', '5%', '1996.96,39.99,49.99', 2086.94, 1982.593, 'chris.lee@outlook.com'),\n",
    "            (8, '2024-08-18', '10%', '199.99,99.99', 299.98, 269.98, 'emily.davis@gmail.com'),\n",
    "            (9, '2024-09-05', '0%', '19.99,89.99,19.99', 129.97, 129.97, 'michael.jordan@yahoo.com'),\n",
    "            (10, '2024-10-10', '25%', '39.99,149.99', 189.99, 142.49, 'susan.martin@hotmail.com'),\n",
    "            (11, '2024-01-22', '12%', '299.99,799.99,79.78', 1179.76, 1037.98, 'nancy.parker@gmail.com'),\n",
    "            (12, '2024-02-15', '8%', '29.99,69.99', 99.98, 91.98, 'kevin.baker@gmail.com'),\n",
    "            (13, '2024-03-30', '3%', '39.99,39.99', 79.98, 77.58, 'patricia.scott@yahoo.com'),\n",
    "            (14, '2024-04-05', '0%', '14.99,49.99', 64.98, 64.98, 'frank.harris@gmail.com'),\n",
    "            (15, '2024-05-11', '20%', '99.99,199.99', 299.98, 239.98, 'isabella.hernandez@gmail.com'),\n",
    "            (16, '2024-06-18', '10%', '49.98,89.99', 139.97, 125.97, 'ryan.carter@gmail.com'),\n",
    "            (17, '2024-07-21', '0%', '34.99,299.99', 334.98, 334.98, 'kimberly.allen@gmail.com'),\n",
    "            (18, '2024-08-12', '5%', '49.99,129.99', 179.98, 170.98, 'hannah.collins@aol.com'),\n",
    "            (19, '2024-09-07', '7%', '59.99,499.99', 559.98, 520.78, 'thomas.anderson@outlook.com'),\n",
    "            (20, '2024-10-02', '10%', '159.96,79.99,29.99', 269.94, 242.95, 'elizabeth.james@gmail.com'),\n",
    "            (21, '2024-01-19', '0%', '199.99,49.99', 249.98, 249.98, 'matthew.reed@hotmail.com'),\n",
    "            (22, '2024-02-14', '15%', '799.99,89.99', 889.98, 756.48, 'mark.adams@gmail.com'),\n",
    "            (23, '2024-03-16', '5%', '299.99,14.99', 314.98, 299.23, 'julia.moore@gmail.com'),\n",
    "            (24, '2024-04-20', '12%', '79.99,9.99', 89.98, 79.18, 'sara.watson@outlook.com'),\n",
    "            (25, '2024-05-25', '0%', '39.99,39.98,49.99', 129.96, 129.96, 'timothy.hall@gmail.com'),\n",
    "            (26, '2024-06-05', '8%', '29.99,199.99', 229.98, 211.58, 'julia.moore@gmail.com'),\n",
    "            (27, '2024-07-18', '20%', '29.99,299.99', 329.98, 263.98, 'joseph.cook@gmail.com'),\n",
    "            (28, '2024-08-22', '3%', '89.99,69.99', 159.98, 155.18, 'aaron.morris@yahoo.com'),\n",
    "            (29, '2024-09-11', '5%', '49.99,89.99,19.99', 159.97, 151.97, 'victoria.mitchell@gmail.com'),\n",
    "            (30, '2024-10-30', '10%', '399.99,299.99', 699.98, 629.98, 'oliver.taylor@gmail.com'),\n",
    "            (31, '2024-01-12', '7%', '129.99,39.99', 169.98, 158.08, 'joseph.cook@gmail.com'),\n",
    "            (32, '2024-02-28', '10%', '69.99,29.99', 99.98, 89.98, 'michael.brown@gmail.com'),\n",
    "            (33, '2024-03-01', '20%', '99.99,49.99', 149.98, 119.98, 'maria.hill@gmail.com'),\n",
    "            (34, '2024-03-28', '0%', '199.99,29.99', 229.98, 229.98, 'diana.king@hotmail.com'),\n",
    "            (35, '2024-04-10', '8%', '249.99,49.99', 299.98, 275.98, 'steven.wright@outlook.com'),\n",
    "            (36, '2024-05-13', '5%', '39.99,19.99', 59.98, 56.98, 'henry.young@gmail.com'),\n",
    "            (37, '2024-06-25', '0%', '59.97,24.99,498.98', 583.94, 583.94, 'megan.foster@outlook.com'),\n",
    "            (38, '2024-07-20', '15%', '49.99,29.99', 79.98, 67.98, 'julia.moore@gmail.com'),\n",
    "            (39, '2024-08-14', '5%', '29.99,9.99', 39.98, 37.98, 'timothy.hall@gmail.com'),\n",
    "            (40, '2024-09-29', '20%', '19.99,99.99', 119.98, 95.98, 'julia.moore@gmail.com'),\n",
    "            (41, '2024-10-15', '0%', '9.99,199.99,24.99', 234.97, 234.97, 'joseph.cook@gmail.com'),\n",
    "            (42, '2024-01-01', '30%', '199.99,79.99', 279.98, 195.99, 'thomas.anderson@outlook.com'),\n",
    "            (43, '2024-02-05', '10%', '129.99,49.99', 179.98, 161.98, 'laura.green@gmail.com'),\n",
    "            (44, '2024-03-08', '5%', '49.99,129.99', 179.98, 170.98, 'kevin.baker@gmail.com'),\n",
    "            (45, '2024-04-15', '0%', '50.00,59.99', 109.99, 109.99, 'sara.watson@outlook.com'),\n",
    "            (46, '2024-05-20', '10%', '29.99,29.99', 59.98, 53.98, 'frank.harris@gmail.com')\n",
    "        ]\n",
    "        \n",
    "        with self.driver.session() as session:\n",
    "            for o in orders:\n",
    "                session.run(\n",
    "                    \"\"\"\n",
    "                    MERGE (ord:Order {order_number:$order_number})\n",
    "                    ON CREATE SET ord.order_date=$order_date, ord.deduction=$deduction, ord.subtotal=$subtotal,\n",
    "                                  ord.sum_subtotal=$sum_subtotal, ord.grand_total=$grand_total, ord.customer_email=$email\n",
    "                    \"\"\",\n",
    "                    order_number=o[0], order_date=o[1], deduction=o[2], subtotal=o[3], \n",
    "                    sum_subtotal=o[4], grand_total=o[5], email=o[6]\n",
    "                )\n",
    "\n",
    "ord_pop = PopulateOrders(uri, username, password)\n",
    "ord_pop.populate_orders()\n",
    "ord_pop.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### B.3 Populate Entity Product"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "class PopulateProducts:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "    def populate_products(self):\n",
    "        products = [\n",
    "            (50001, 'Smartphone', 'TechBrand', 'Black', 0.2, 699.99, '15x7x0.8 cm', 30, 'Latest smartphone with cutting-edge features', 'True', '2 years', 601, '0001', 719),\n",
    "            (50002, 'Laptop', 'CompTech', 'Silver', 1.5, 1299.99, '35x24x2 cm', 20, 'Powerful laptop for professionals', 'False', '3 years', 602, '0001', 701),\n",
    "            (50003, 'Headphones', 'SoundCo', 'Black', 0.3, 199.99, '15x15x5 cm', 25, 'Wireless headphones with noise cancellation', 'True', '1 year', None, '0002', 708),\n",
    "            (50004, 'Microwave Oven', 'HomeAppliance', 'Silver', 15.0, 399.99, '50x40x30 cm', 15, 'Compact microwave oven for quick meals', 'True', '2 years', None, '0002', 702),\n",
    "            (50005, 'Blender', 'KitchenAid', 'Red', 3.0, 89.99, '40x20x20 cm', 45, 'High-speed blender for smoothies', 'True', '1 year', None, '0002', None),\n",
    "            (50006, 'Refrigerator', 'FridgePro', 'White', 60.0, 1299.99, '180x70x70 cm', 10, 'Large refrigerator with energy efficiency', 'False', '3 years', 601, '0003', 717),\n",
    "            (50007, 'Sofa', 'ComfortHome', 'Brown', 100.0, 499.99, '200x80x90 cm', 5, 'Stylish sofa for living room', 'True', '2 years', None, '0009', 701),\n",
    "            (50008, 'Coffee Table', 'ModernLiving', 'Glass', 20.0, 199.99, '120x60x40 cm', 30, 'Elegant coffee table for home', 'True', '1 year', None, '0009', 710),\n",
    "            (50009, 'T-Shirt', 'FashionBrand', 'Blue', 0.2, 19.99, 'L', 100, 'Casual T-shirt for everyday wear', 'True', '1 year', None, '0003', 702),\n",
    "            (50010, 'Jeans', 'DenimCo', 'Black', 0.5, 39.99, '32', 50, 'Comfortable jeans for all occasions', 'False', '1 year', None, '0003', None),\n",
    "            (50011, 'Watch', 'TimeBrand', 'Gold', 0.1, 299.99, '10x10 cm', 15, 'Elegant wristwatch with leather strap', 'True', '2 years', None, '0014', 701),\n",
    "            (50012, 'Sunscreen', 'SkinCare', 'White', 0.2, 29.99, '15x5 cm', 35, 'SPF 50 sunscreen for skin protection', 'True', '1 year', None, '0004', 714),\n",
    "            (50013, 'Yoga Mat', 'FitGear', 'Purple', 1.0, 39.99, '180x60 cm', 25, 'Non-slip yoga mat for workouts', 'True', '1 year', None, '0006', 702),\n",
    "            (50014, 'Fiction Novel', 'BookPublisher', 'N/A', 0.5, 14.99, '20x13 cm', 50, 'Bestselling fiction novel', 'True', '1 year', None, '0005', 708),\n",
    "            (50015, 'Fitness Tracker', 'FitTrack', 'Black', 0.1, 99.99, '5x5 cm', 30, 'Wearable fitness tracker for health monitoring', 'True', '1 year', None, '0006', 701),\n",
    "            (50016, 'Soccer Ball', 'SportCo', 'White', 0.4, 24.99, '22 cm', 40, 'Official size soccer ball for matches', 'True', '1 year', None, '0006', 707),\n",
    "            (50017, 'Board Game', 'FunGames', 'Multicolor', 1.5, 34.99, '30x30x5 cm', 20, 'Exciting board game for family fun', 'True', '1 year', None, '0007', 701),\n",
    "            (50018, 'Car Seat Cover', 'AutoComfort', 'Black', 1.0, 49.99, 'Universal', 30, 'Protective cover for car seats', 'True', '2 years', None, '0008', 709),\n",
    "            (50019, 'Garden Tools Set', 'GreenThumb', 'Green', 2.0, 59.99, '40x30 cm', 25, 'Complete set of gardening tools', 'False', '1 year', 601, '0006', 702),\n",
    "            (50020, 'Camping Lantern', 'OutdoorGear', 'Yellow', 1.5, 39.99, '30 cm', 35, 'Bright lantern for camping trips', 'True', '1 year', None, '0006', None),\n",
    "            (50021, 'Action Camera', 'ActionPro', 'Black', 0.4, 199.99, '10x5x5 cm', 18, 'Waterproof action camera for adventures', 'True', '2 years', None, '0001', 701),\n",
    "            (50022, 'Washing Machine', 'CleanTech', 'White', 75.0, 799.99, '85x60x60 cm', 12, 'High-efficiency washing machine', 'True', '3 years', None, '0002', 702),\n",
    "            (50023, 'Vacuum Cleaner', 'CleanPro', 'Silver', 6.0, 299.99, '30x30x110 cm', 30, 'Powerful vacuum cleaner for home', 'True', '1 year', None, '0002', None),\n",
    "            (50024, 'Coffee Maker', 'BrewMaster', 'Black', 5.0, 79.99, '30x20x20 cm', 25, 'Programmable coffee maker for home', 'False', '1 year', 603, '0002', 701),\n",
    "            (50025, 'Electric Kettle', 'KitchenAid', 'Silver', 1.0, 39.99, '25x15 cm', 35, 'Fast boiling electric kettle', 'True', '1 year', None, '0002', 709),\n",
    "            (50026, 'Frying Pan', 'Cookware', 'Black', 1.0, 29.99, '30x30 cm', 40, 'Non-stick frying pan for cooking', 'True', '2 years', None, '0002', 701),\n",
    "            (50027, 'Cookbook', 'Foodie', 'N/A', 0.5, 29.99, '25x20 cm', 35, 'Delicious recipes for home cooking', 'True', '1 year', None, '0005', 712),\n",
    "            (50028, 'Tennis Racket', 'SportPro', 'Red', 0.4, 89.99, '70x25x5 cm', 30, 'High-quality tennis racket', 'True', '2 years', None, '0006', 702),\n",
    "            (50029, 'Fishing Rod', 'FishGear', 'Green', 1.0, 49.99, '210 cm', 25, 'Durable fishing rod for anglers', 'False', '3 years', 601, '0006', 711),\n",
    "            (50030, 'Bicycle', 'BikePro', 'Blue', 12.0, 399.99, '170 cm', 10, 'Mountain bike for all terrains', 'True', '2 years', None, '0006', None),\n",
    "            (50031, 'Tent', 'CampingCo', 'Green', 3.0, 129.99, '250x200x150 cm', 15, 'Waterproof tent for camping', 'True', '1 year', 604, '0008', 701),\n",
    "            (50032, 'Sleeping Bag', 'OutdoorGear', 'Red', 1.0, 69.99, '210 cm', 20, 'Comfortable sleeping bag for camping', 'False', '2 years', 605, '0008', None),\n",
    "            (50033, 'GPS Device', 'NavTech', 'Black', 0.5, 99.99, '10x10 cm', 15, 'Accurate GPS device for navigation', 'True', '1 year', 603, '0001', None),\n",
    "            (50034, 'Leather Jacket', 'FashionCo', 'Black', 1.2, 199.99, 'M', 25, 'Stylish leather jacket for men', 'True', '2 years', None, '0003', None),\n",
    "            (50035, 'Smart Watch', 'TechBrand', 'Silver', 0.2, 249.99, '4x4 cm', 40, 'Smart watch with fitness tracking', 'True', '2 years', None, '0014', 701),\n",
    "            (50036, 'Wireless Charger', 'ChargeCo', 'Black', 0.1, 39.99, '10x10 cm', 30, 'Fast wireless charger for smartphones', 'True', '1 year', None, '0001', 713),\n",
    "            (50037, 'Puzzle', 'FunGames', 'Multicolor', 0.8, 19.99, '30x30 cm', 20, 'Challenging jigsaw puzzle', 'False', '1 year', 602, '0007', None),\n",
    "            (50038, 'Hair Dryer', 'BeautyPro', 'Pink', 0.5, 49.99, '25x10 cm', 35, 'Powerful hair dryer for styling', 'True', '1 year', None, '0004', 702),\n",
    "            (50039, 'Face Cream', 'BeautyBrand', 'White', 0.2, 29.99, '50 ml', 30, 'Moisturizing face cream', 'True', '1 year', None, '0004', 715),\n",
    "            (50040, 'Vitamins', 'HealthPlus', 'N/A', 0.1, 19.99, '60 capsules', 35, 'Daily vitamins for health', 'True', '1 year', None, '0004', 714),\n",
    "            (50041, 'Notebook', 'OfficeCo', 'Blue', 0.3, 9.99, 'A4', 45, 'Spiral-bound notebook', 'True', '1 year', None, '0012', 702),\n",
    "            (50042, 'Printer', 'PrintCo', 'Black', 5.0, 199.99, '40x30x15 cm', 25, 'Color printer for home and office', 'True', '2 years', None, '0012', 720),\n",
    "            (50043, 'Office Chair', 'ComfortOffice', 'Gray', 10.0, 129.99, '100x60x90 cm', 15, 'Ergonomic office chair', 'True', '3 years', None, '0012', 701),\n",
    "            (50044, 'Router', 'NetTech', 'Black', 0.5, 49.99, '25x20x5 cm', 35, 'High-speed wireless router', 'True', '1 year', None, '0011', None),\n",
    "            (50045, 'Video Game', 'GameBrand', 'N/A', 0.08, 50.00, 'N/A', 30, 'Latest video game for console', 'True', '1 year', None, '0011', 702),\n",
    "            (50046, 'Wireless Mouse', 'TechCo', 'Black', 0.1, 29.99, '10x6 cm', 40, 'Ergonomic wireless mouse', 'True', '1 year', None, '0011', None),\n",
    "            (50047, 'Camera', 'PhotoTech', 'Black', 1.0, 799.99, '15x10x5 cm', 10, 'DSLR camera with high resolution', 'True', '3 years', 604, '0001', None),\n",
    "            (50048, 'Smart Speaker', 'AudioBrand', 'White', 0.8, 99.99, '15x15x10 cm', 20, 'Smart speaker with voice assistant', 'True', '2 years', None, '0001', 716),\n",
    "            (50049, 'Desk', 'OfficeBrand', 'Brown', 15.0, 299.99, '140x70x75 cm', 15, 'Wooden desk for office', 'True', '2 years', None, '0012', 701),\n",
    "            (50050, 'Tablet', 'GadgetCo', 'Black', 0.5, 399.99, '24x17x0.5 cm', 25, 'Portable tablet for work and play', 'True', '1 year', None, '0001', 717),\n",
    "            (50051, 'Garden Chair', 'OutdoorBrand', 'Green', 5.0, 49.99, '60x60x90 cm', 35, 'Comfortable chair for outdoor use', 'True', '2 years', None, '0006', 702),\n",
    "            (50052, 'Smart Bulb', 'LightTech', 'White', 0.1, 19.99, '10x10 cm', 40, 'Smart bulb with app control', 'True', '1 year', 601, '0002', None),\n",
    "            (50053, 'Baking Set', 'KitchenCraft', 'Multicolor', 1.0, 39.99, '30x30 cm', 30, 'Complete baking set for enthusiasts', 'True', '2 years', None, '0002', 701),\n",
    "            (50054, 'Electric Toothbrush', 'OralCare', 'Blue', 0.5, 99.99, '20x5 cm', 25, 'Electric toothbrush with timer', 'True', '1 year', None, '0004', 713),\n",
    "            (50055, 'Home Security Camera', 'SecureHome', 'Black', 0.3, 89.99, '10x10 cm', 30, 'Smart security camera with night vision', 'True', '2 years', None, '0011', 702),\n",
    "            (50056, 'Heater', 'HeatPro', 'White', 10.0, 149.99, '40x40x80 cm', 15, 'Portable heater for winter', 'True', '1 year', 603, '0002', None),\n",
    "            (50057, 'Air Conditioner', 'CoolTech', 'White', 30.0, 799.99, '75x50x30 cm', 10, 'Energy-efficient air conditioner', 'True', '3 years', None, '0002', 708),\n",
    "            (50058, 'Bluetooth Speaker', 'SoundBrand', 'Black', 1.0, 69.99, '20x10 cm', 25, 'Portable Bluetooth speaker with deep bass', 'True', '1 year', None, '0011', 701),\n",
    "            (50059, 'Electric Fan', 'AirFlow', 'White', 2.0, 39.99, '40x40x100 cm', 30, 'Cooling fan for home', 'True', '1 year', None, '0002', None),\n",
    "            (50060, 'Window Blinds', 'HomeDecor', 'Beige', 1.0, 49.99, '120x100 cm', 20, 'Adjustable window blinds', 'True', '1 year', None, '0009', 702),\n",
    "            (50061, 'Air Fryer', 'CookMaster', 'Black', 5.0, 199.99, '30x30x30 cm', 15, 'Healthy air fryer for cooking', 'True', '2 years', None, '0002', 715),\n",
    "            (50062, 'Pressure Cooker', 'KitchenAid', 'Silver', 4.0, 89.99, '25x25 cm', 25, 'Electric pressure cooker', 'True', '1 year', None, '0002', 701),\n",
    "            (50063, 'Drone', 'FlyTech', 'White', 0.8, 299.99, '30x30 cm', 20, 'High-performance drone with camera', 'True', '2 years', 605, '0001', None),\n",
    "            (50064, 'E-Reader', 'ReadPro', 'Black', 0.3, 129.99, '15x10 cm', 30, 'Portable e-reader for books', 'True', '1 year', None, '0005', 702),\n",
    "            (50065, 'Video Projector', 'VisionPro', 'Black', 3.0, 499.99, '30x30 cm', 15, 'High-resolution video projector', 'True', '2 years', None, '0011', 720),\n",
    "            (50066, 'Smart Home Hub', 'SmartHome', 'White', 0.5, 79.99, '10x10 cm', 40, 'Hub for connecting smart devices', 'True', '1 year', None, '0001', 718),\n",
    "            (50067, 'Webcam', 'TechCam', 'Black', 0.3, 49.99, '10x10 cm', 30, 'HD webcam for video calls', 'True', '1 year', None, '0011', 701),\n",
    "            (50068, 'Cordless Drill', 'ToolBrand', 'Red', 1.5, 89.99, '25x10 cm', 25, 'Powerful cordless drill for DIY', 'True', '2 years', None, '0002', 719),\n",
    "            (50069, 'Hammer', 'ToolPro', 'Gray', 1.0, 14.99, '30 cm', 40, 'Durable hammer for construction', 'True', '1 year', None, '0002', 702),\n",
    "            (50070, 'Tape Measure', 'ToolKit', 'Yellow', 0.3, 9.99, '5 m', 35, 'Compact tape measure for measuring', 'True', '1 year', None, '0002', 720),\n",
    "            (50071, 'Garden Hose', 'OutdoorBrand', 'Green', 2.0, 19.99, '30 m', 30, 'Durable garden hose for watering', 'True', '1 year', None, '0006', 701),\n",
    "            (50072, 'Patio Table', 'OutdoorCo', 'Brown', 15.0, 199.99, '120x80 cm', 15, 'Sturdy patio table for outdoor dining', 'True', '2 years', 601, '0008', 701),\n",
    "            (50073, 'Outdoor Grill', 'BBQPro', 'Black', 10.0, 299.99, '80x60 cm', 10, 'Portable grill for barbecues', 'True', '3 years', None, '0008', 702),\n",
    "            (50074, 'Camping Stove', 'OutdoorGear', 'Silver', 2.0, 69.99, '40x30 cm', 25, 'Compact camping stove', 'True', '1 year', None, '0008', None),\n",
    "            (50075, 'Hiking Backpack', 'TravelPro', 'Blue', 1.5, 89.99, '50x30x15 cm', 35, 'Durable backpack for hiking', 'True', '2 years', None, '0006', 701),\n",
    "            (50076, 'Inflatable Kayak', 'WaterSports', 'Yellow', 8.0, 299.99, '300 cm', 15, 'Inflatable kayak for water sports', 'True', '1 year', 602, '0006', 703),\n",
    "            (50077, 'Fishing Tackle Box', 'FishGear', 'Green', 2.0, 39.99, '50x30x20 cm', 25, 'Spacious tackle box for fishing gear', 'True', '1 year', None, '0006', 702),\n",
    "            (50078, 'Thermos Flask', 'TravelBrand', 'Silver', 0.5, 29.99, '25x10 cm', 40, 'Insulated flask for hot drinks', 'True', '1 year', None, '0004', None),\n",
    "            (50079, 'Camping Hammock', 'OutdoorCo', 'Green', 1.0, 49.99, '250 cm', 20, 'Lightweight hammock for relaxation', 'True', '1 year', 605, '0008', 704),\n",
    "            (50080, 'Portable Charger', 'ChargeTech', 'Black', 0.2, 29.99, '10x5 cm', 35, 'Compact charger for devices', 'True', '1 year', None, '0001', 702),\n",
    "            (50081, 'Leather Wallet', 'FashionBrand', 'Brown', 0.1, 49.99, '10x10 cm', 30, 'Stylish leather wallet', 'True', '1 year', None, '0014', None),\n",
    "            (50082, 'Smartphone Case', 'TechBrand', 'Black', 0.1, 19.99, '15x7 cm', 25, 'Protective case for smartphones', 'True', '1 year', None, '0001', 705),\n",
    "            (50083, 'Action Figure', 'ToyBrand', 'Multicolor', 0.5, 24.99, '20x10 cm', 40, 'Collectible action figure', 'True', '1 year', None, '0007', 701),\n",
    "            (50084, 'Puzzle Mat', 'FunGames', 'Blue', 1.0, 29.99, '150x100 cm', 35, 'Non-slip mat for puzzles', 'True', '1 year', None, '0007', None),\n",
    "            (50085, 'Balloon Set', 'PartyBrand', 'Multicolor', 0.2, 9.99, 'Variety', 50, 'Set of colorful balloons', 'True', '1 year', None, '0007', 702),\n",
    "            (50086, 'Kids Bike', 'ToyBrand', 'Pink', 5.0, 99.99, '100 cm', 20, 'Safe bike for kids', 'True', '2 years', 601, '0006', None),\n",
    "            (50087, 'Stroller', 'BabyBrand', 'Gray', 10.0, 199.99, '100x60x100 cm', 15, 'Convenient stroller for babies', 'True', '3 years', 602, '0006', None),\n",
    "            (50088, 'Baby Monitor', 'BabyTech', 'White', 0.5, 79.99, '10x10 cm', 25, 'Smart baby monitor with camera', 'True', '1 year', None, '0004', 701),\n",
    "            (50089, 'Diaper Bag', 'BabyCare', 'Blue', 0.5, 49.99, '40x30x10 cm', 30, 'Stylish diaper bag for parents', 'True', '1 year', None, '0004', None),\n",
    "            (50090, 'Kids Tablet', 'GadgetCo', 'Pink', 0.5, 129.99, '24x17x0.5 cm', 20, 'Tablet designed for kids', 'True', '2 years', None, '0001', None),\n",
    "            (50091, 'Activity Gym', 'BabyFun', 'Multicolor', 2.0, 59.99, '100 cm', 15, 'Interactive gym for babies', 'True', '1 year', None, '0006', 702),\n",
    "            (50092, 'Toddler Shoes', 'FashionKids', 'Red', 0.5, 29.99, 'Size 5', 40, 'Comfortable shoes for toddlers', 'True', '1 year', None, '0003', None),\n",
    "            (50093, 'Kids Art Set', 'CreativeKids', 'Multicolor', 0.5, 24.99, '40x30 cm', 30, 'Complete art set for kids', 'True', '1 year', None, '0007', 701),\n",
    "            (50094, 'Kids Bed', 'FurnitureCo', 'Blue', 25.0, 299.99, '130x70 cm', 10, 'Comfortable bed for kids', 'True', '2 years', None, '0009', 707),\n",
    "            (50095, 'Bike Helmet', 'SafetyGear', 'Black', 0.5, 49.99, 'N/A', 25, 'Protective helmet for biking', 'True', '1 year', None, '0006', 702),\n",
    "            (50096, 'Kids Puzzle', 'FunGames', 'Multicolor', 0.5, 19.99, '30x30 cm', 35, 'Educational puzzle for kids', 'True', '1 year', 605, '0007', 706),\n",
    "            (50097, 'Baby Clothes', 'FashionBaby', 'Pink', 0.5, 29.99, 'Variety', 30, 'Comfortable clothes for babies', 'True', '1 year', None, '0003', 701),\n",
    "            (50098, 'Playmat', 'BabyFun', 'Multicolor', 2.0, 49.99, '150x150 cm', 15, 'Soft playmat for babies', 'True', '1 year', None, '0006', None),\n",
    "            (50099, 'Kids Swim Set', 'SwimBrand', 'Blue', 0.5, 39.99, 'Variety', 20, 'Complete swim set for kids', 'True', '2 years', 601, '0006', None),\n",
    "            (50100, 'Kids Bike Accessories', 'BikeFun', 'Black', 0.3, 19.99, 'Variety', 30, 'Accessories for kids bikes', 'True', '1 year', None, '0006', 701)\n",
    "        ]\n",
    "        \n",
    "        with self.driver.session() as session:\n",
    "            for p in products:\n",
    "                session.run(\n",
    "                    \"\"\"\n",
    "                    MERGE (pr:Product {product_number:$product_number})\n",
    "                    ON CREATE SET pr.short_name=$short_name, pr.brand=$brand, pr.color=$color, pr.weight=$weight,\n",
    "                                  pr.price=$price, pr.dimensions=$dimensions, pr.stock_quantity=$stock_quantity,\n",
    "                                  pr.textual_description=$textual_description, pr.is_available=$is_available,\n",
    "                                  pr.warranty_period=$warranty_period, pr.ticket_number=$ticket_number,\n",
    "                                  pr.category_id=$category_id, pr.wishlist_id=$wishlist_id\n",
    "                    \"\"\",\n",
    "                    product_number=p[0], short_name=p[1], brand=p[2], color=p[3], weight=p[4], price=p[5],\n",
    "                    dimensions=p[6], stock_quantity=p[7], textual_description=p[8], is_available=p[9],\n",
    "                    warranty_period=p[10], ticket_number=p[11], category_id=p[12], wishlist_id=p[13]\n",
    "                )\n",
    "\n",
    "prod_pop = PopulateProducts(uri, username, password)\n",
    "prod_pop.populate_products()\n",
    "prod_pop.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### B.4 Populate Entity Category"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "class PopulateCategories:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "    def populate_categories(self):\n",
    "        categories = [\n",
    "            ('0001', 'Electronics'),\n",
    "            ('0002', 'Home Appliances'),\n",
    "            ('0003', 'Fashion'),\n",
    "            ('0004', 'Health & Beauty'),\n",
    "            ('0005', 'Books'),\n",
    "            ('0006', 'Sports & Outdoors'),\n",
    "            ('0007', 'Toys & Games'),\n",
    "            ('0008', 'Automotive'),\n",
    "            ('0009', 'Furniture'),\n",
    "            ('0010', 'Groceries'),\n",
    "            ('0011', 'Music & Entertainment'),\n",
    "            ('0012', 'Office Supplies'),\n",
    "            ('0013', 'Pet Supplies'),\n",
    "            ('0014', 'Jewelry & Accessories'),\n",
    "            ('0015', 'Garden & Outdoor')\n",
    "        ]\n",
    "        with self.driver.session() as session:\n",
    "            for cat in categories:\n",
    "                session.run(\n",
    "                    \"\"\"\n",
    "                    MERGE (c:Category {category_id:$category_id})\n",
    "                    ON CREATE SET c.category_type=$category_type\n",
    "                    \"\"\",\n",
    "                    category_id=cat[0], category_type=cat[1]\n",
    "                )\n",
    "\n",
    "cat_pop = PopulateCategories(uri, username, password)\n",
    "cat_pop.populate_categories()\n",
    "cat_pop.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### B.5 Populate Entity Wishlist"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "class PopulateWishlist:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "    def populate_wishlist(self):\n",
    "        wishlists = [\n",
    "            (701, 3, 'julia.moore@gmail.com'),\n",
    "            (702, 1, 'timothy.hall@gmail.com'),\n",
    "            (703, 2, 'isabella.hernandez@gmail.com'),\n",
    "            (704, 5, 'julia.moore@gmail.com'),\n",
    "            (705, 2, 'carol.white@outlook.com'),\n",
    "            (706, 4, 'laura.green@gmail.com'),\n",
    "            (707, 1, 'julia.moore@gmail.com'),\n",
    "            (708, 3, 'emily.davis@gmail.com'),\n",
    "            (709, 2, 'michael.jordan@yahoo.com'),\n",
    "            (710, 6, 'susan.martin@hotmail.com'),\n",
    "            (711, 2, 'nancy.parker@gmail.com'),\n",
    "            (712, 4, 'kevin.baker@gmail.com'),\n",
    "            (713, 1, 'timothy.hall@gmail.com'),\n",
    "            (714, 5, 'frank.harris@gmail.com'),\n",
    "            (715, 3, 'isabella.hernandez@gmail.com'),\n",
    "            (716, 2, 'ryan.carter@gmail.com'),\n",
    "            (717, 1, 'kimberly.allen@gmail.com'),\n",
    "            (718, 6, 'hannah.collins@aol.com'),\n",
    "            (719, 3, 'elizabeth.james@gmail.com'),\n",
    "            (720, 4, 'thomas.anderson@outlook.com')\n",
    "        ]\n",
    "        with self.driver.session() as session:\n",
    "            for w in wishlists:\n",
    "                session.run(\n",
    "                    \"\"\"\n",
    "                    MERGE (wl:Wishlist {wishlist_id:$wishlist_id})\n",
    "                    ON CREATE SET wl.product_quantity=$product_quantity, wl.customer_email=$email\n",
    "                    \"\"\",\n",
    "                    wishlist_id=w[0], product_quantity=w[1], email=w[2]\n",
    "                )\n",
    "\n",
    "wl_pop = PopulateWishlist(uri, username, password)\n",
    "wl_pop.populate_wishlist()\n",
    "wl_pop.close()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### B.6 Populate Entity PaymentMethod"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "class PopulatePaymentMethods:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "    def populate_payment_methods(self):\n",
    "        payment_methods = [\n",
    "            (101, 1, 'john.doe@gmail.com'),\n",
    "            (102, 2, 'jane.smith@outlook.com'),\n",
    "            (103, 3, 'alice.jones@gmail.com'),\n",
    "            (104, 4, 'bob.brown@outlook.com'),\n",
    "            (105, 5, 'carol.white@outlook.com'),\n",
    "            (106, 6, 'laura.green@gmail.com'),\n",
    "            (107, 7, 'chris.lee@outlook.com'),\n",
    "            (108, 8, 'emily.davis@gmail.com'),\n",
    "            (109, 9, 'michael.jordan@yahoo.com'),\n",
    "            (110, 10, 'susan.martin@hotmail.com'),\n",
    "            (111, 11, 'nancy.parker@gmail.com'),\n",
    "            (112, 12, 'kevin.baker@gmail.com'),\n",
    "            (113, 13, 'patricia.scott@yahoo.com'),\n",
    "            (114, 14, 'frank.harris@gmail.com'),\n",
    "            (115, 15, 'isabella.hernandez@gmail.com'),\n",
    "            (116, 16, 'ryan.carter@gmail.com'),\n",
    "            (117, 17, 'kimberly.allen@gmail.com'),\n",
    "            (118, 18, 'hannah.collins@aol.com'),\n",
    "            (119, 19, 'thomas.anderson@outlook.com'),\n",
    "            (120, 20, 'elizabeth.james@gmail.com'),\n",
    "            (121, 21, 'matthew.reed@hotmail.com'),\n",
    "            (122, 22, 'mark.adams@gmail.com'),\n",
    "            (123, 23, 'julia.moore@gmail.com'),\n",
    "            (124, 24, 'sara.watson@outlook.com'),\n",
    "            (125, 25, 'timothy.hall@gmail.com'),\n",
    "            (126, 26, 'julia.moore@gmail.com'),\n",
    "            (127, 27, 'joseph.cook@gmail.com'),\n",
    "            (128, 28, 'aaron.morris@yahoo.com'),\n",
    "            (129, 29, 'victoria.mitchell@gmail.com'),\n",
    "            (130, 30, 'oliver.taylor@gmail.com'),\n",
    "            (131, 31, 'joseph.cook@gmail.com'),\n",
    "            (132, 32, 'michael.brown@gmail.com'),\n",
    "            (133, 33, 'maria.hill@gmail.com'),\n",
    "            (134, 34, 'diana.king@hotmail.com'),\n",
    "            (135, 35, 'steven.wright@outlook.com'),\n",
    "            (136, 36, 'henry.young@gmail.com'),\n",
    "            (137, 37, 'megan.foster@outlook.com'),\n",
    "            (138, 38, 'julia.moore@gmail.com'),\n",
    "            (139, 39, 'timothy.hall@gmail.com'),\n",
    "            (140, 40, 'julia.moore@gmail.com'),\n",
    "            (141, 41, 'joseph.cook@gmail.com'),\n",
    "            (142, 42, 'thomas.anderson@outlook.com'),\n",
    "            (143, 43, 'laura.green@gmail.com'),\n",
    "            (144, 44, 'kevin.baker@gmail.com'),\n",
    "            (145, 45, 'sara.watson@outlook.com'),\n",
    "            (146, 46, 'frank.harris@gmail.com')\n",
    "        ]\n",
    "        with self.driver.session() as session:\n",
    "            for pm in payment_methods:\n",
    "                session.run(\n",
    "                    \"\"\"\n",
    "                    MERGE (p:PaymentMethod {payment_method_id:$pmid})\n",
    "                    ON CREATE SET p.order_number=$order_number, p.customer_email=$email\n",
    "                    \"\"\",\n",
    "                    pmid=pm[0], order_number=pm[1], email=pm[2]\n",
    "                )\n",
    "\n",
    "pm_pop = PopulatePaymentMethods(uri, username, password)\n",
    "pm_pop.populate_payment_methods()\n",
    "pm_pop.close()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### B.7 Populate Entity CreditCard"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "class PopulateCreditCards:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "    def populate_credit_cards(self):\n",
    "        credit_cards = [\n",
    "            (901, '123', '4112785638491723', '2025-01', 'John Doe', 'true', 101, 1),\n",
    "            (902, '456', '4228463190047812', '2026-02', 'Jane Smith', 'true', 102, 2),\n",
    "            (903, '789', '4337198052246111', '2025-03', 'Alice Jones', 'true', 103, 3),\n",
    "            (904, '012', '4442839056873291', '2027-04', 'Bob Brown', 'true', 104, 4),\n",
    "            (905, '345', '4559864120346753', '2026-05', 'Carol White', 'true', 105, 5),\n",
    "            (906, '678', '4663041752198742', '2025-06', 'Laura Green', 'true', 106, 6),\n",
    "            (907, '901', '4773918465129430', '2024-07', 'Chris Lee', 'true', 107, 7),\n",
    "            (908, '234', '4882956173402987', '2025-08', 'Emily Davis', 'true', 108, 8),\n",
    "            (909, '567', '4996127309456123', '2026-09', 'Michael Jordan', 'true', 109, 9),\n",
    "            (910, '890', '4007258391620748', '2025-10', 'Susan Martin', 'true', 110, 10),\n",
    "            (911, '123', '4112045678302916', '2026-11', 'Nancy Parker', 'true', 111, 11),\n",
    "            (912, '456', '4228391754062135', '2025-12', 'Kevin Baker', 'true', 112, 12),\n",
    "            (913, '789', '4337204890312347', '2027-01', 'Patricia Scott', 'true', 113, 13),\n",
    "            (914, '012', '4441293658712234', '2026-02', 'Frank Harris', 'true', 114, 14),\n",
    "            (915, '345', '4558967023148795', '2025-03', 'Isabella Hernandez', 'true', 115, 15),\n",
    "            (916, '678', '4662183947502349', '2027-04', 'Ryan Carter', 'true', 116, 16),\n",
    "            (917, '901', '4779354812602348', '2026-05', 'Kimberly Allen', 'true', 117, 17),\n",
    "            (918, '234', '4882975126301945', '2025-06', 'Hannah Collins', 'true', 118, 18),\n",
    "            (919, '567', '4998134201579203', '2026-07', 'Thomas Anderson', 'true', 119, 19),\n",
    "            (920, '890', '4002983746109471', '2025-08', 'Elizabeth James', 'true', 120, 20),\n",
    "            (921, '123', '4117846192031742', '2026-09', 'Matthew Reed', 'true', 121, 21),\n",
    "            (922, '456', '4229708156342098', '2025-10', 'Mark Adams', 'true', 122, 22),\n",
    "            (923, '789', '4335129082734956', '2027-11', 'Julia Moore', 'true', 123, 23),\n",
    "            (924, '012', '4441298456209183', '2026-12', 'Sara Watson', 'true', 124, 24),\n",
    "            (925, '345', '4556748930175623', '2025-01', 'Timothy Hall', 'true', 125, 25),\n",
    "            (926, '678', '4669135407620194', '2027-02', 'Julia Moore', 'true', 126, 26),\n",
    "            (927, '901', '4771352046073895', '2026-03', 'Joseph Cook', 'true', 127, 27),\n",
    "            (928, '234', '4882043795612870', '2025-04', 'Aaron Morris', 'true', 128, 28),\n",
    "            (929, '567', '4997120348691753', '2026-05', 'Victoria Mitchell', 'true', 129, 29),\n",
    "            (930, '890', '4002316789502347', '2025-06', 'Oliver Taylor', 'true', 130, 30),\n",
    "            (931, '123', '4115689023745108', '2026-07', 'Joseph Cook', 'true', 131, 31),\n",
    "            (932, '456', '4223047195062974', '2025-08', 'Michael Brown', 'true', 132, 32),\n",
    "            (933, '789', '4338902473621409', '2027-09', 'Maria Hill', 'true', 133, 33),\n",
    "            (934, '012', '4443072948712059', '2026-10', 'Diana King', 'true', 134, 34),\n",
    "            (935, '345', '4559027310542893', '2025-11', 'Steven Wright', 'true', 135, 35)\n",
    "        ]\n",
    "        with self.driver.session() as session:\n",
    "            for cc in credit_cards:\n",
    "                session.run(\n",
    "                    \"\"\"\n",
    "                    MERGE (c:CreditCard {credit_card_id:$ccid})\n",
    "                    ON CREATE SET c.verification_code=$verification_code, c.card_number=$card_number, c.cc_expiry_date=$cc_expiry_date,\n",
    "                                  c.name_on_card=$name_on_card, c.is_default=$is_default, c.payment_method_id=$payment_method_id,\n",
    "                                  c.order_number=$order_number\n",
    "                    \"\"\",\n",
    "                    ccid=cc[0], verification_code=cc[1], card_number=cc[2], cc_expiry_date=cc[3],\n",
    "                    name_on_card=cc[4], is_default=cc[5], payment_method_id=cc[6], order_number=cc[7]\n",
    "                )\n",
    "\n",
    "cc_pop = PopulateCreditCards(uri, username, password)\n",
    "cc_pop.populate_credit_cards()\n",
    "cc_pop.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### B.8 Populate Entity GiftCard"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "class PopulateGiftCards:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "    def populate_gift_cards(self):\n",
    "        gift_cards = [\n",
    "            (801, 1500.00, 5000.00, '2025-12-31', 'GC20241001A', 136, 36),\n",
    "            (802, 3000.00, 10000.00, '2026-06-30', 'GC20241002B', 137, 37),\n",
    "            (803, 7000.00, 7500.00, '2026-11-15', 'GC20241003C', 138, 38),\n",
    "            (804, 5000.00, 6000.00, '2025-07-25', 'GC20241004D', 139, 39),\n",
    "            (805, 2000.00, 15000.00, '2026-08-20', 'GC20241005E', 140, 40),\n",
    "            (806, 3000.00, 5000.00, '2025-09-15', 'GC20241006F', 141, 41),\n",
    "            (807, 4500.00, 7000.00, '2027-01-05', 'GC20241007G', 142, 42),\n",
    "            (808, 5000.00, 7500.00, '2026-04-10', 'GC20241008H', 143, 43),\n",
    "            (809, 1200.50, 6000.00, '2025-03-30', 'GC20241009I', 144, 44),\n",
    "            (810, 1200.00, 3000.00, '2026-10-15', 'GC20241010J', 145, 45),\n",
    "            (811, 1900.00, 2500.00, '2025-05-05', 'GC20241011K', 146, 46)\n",
    "        ]\n",
    "        with self.driver.session() as session:\n",
    "            for gc in gift_cards:\n",
    "                session.run(\n",
    "                    \"\"\"\n",
    "                    MERGE (g:GiftCard {gift_card_id:$gcid})\n",
    "                    ON CREATE SET g.current_balances=$current_balances, g.total_amount=$total_amount, g.gc_expiry_date=$gc_expiry_date,\n",
    "                                  g.serial_number=$serial_number, g.payment_method_id=$payment_method_id, g.order_number=$order_number\n",
    "                    \"\"\",\n",
    "                    gcid=gc[0], current_balances=gc[1], total_amount=gc[2], gc_expiry_date=gc[3],\n",
    "                    serial_number=gc[4], payment_method_id=gc[5], order_number=gc[6]\n",
    "                )\n",
    "\n",
    "gc_pop = PopulateGiftCards(uri, username, password)\n",
    "gc_pop.populate_gift_cards()\n",
    "gc_pop.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### B.9 Populate Entity Return"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "class PopulateReturn:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "    def populate_return(self):\n",
    "        returns = [\n",
    "            (601, '2024-05-01', '2024-05-15', 'Completed', 19.13, 363.37, 4),\n",
    "            (602, '2024-09-10', '2024-09-24', 'Pending', 16.28, 216.22, 19),\n",
    "            (603, '2024-05-05', '2024-05-20', 'In Progress', 13.20, 250.80, 24),\n",
    "            (604, '2024-10-01', '2024-10-15', 'Completed', 1.31, 42.34, 28),\n",
    "            (605, '2024-11-01', '2024-11-15', 'Pending', 7.20, 352.80, 40)\n",
    "        ]\n",
    "        with self.driver.session() as session:\n",
    "            for r in returns:\n",
    "                session.run(\n",
    "                    \"\"\"\n",
    "                    MERGE (ret:Return {ticket_number:$ticket_number})\n",
    "                    ON CREATE SET ret.start_date=$start_date, ret.due_date=$due_date, ret.return_status=$return_status,\n",
    "                                  ret.return_fee=$return_fee, ret.refund_total=$refund_total, ret.order_number=$order_number\n",
    "                    \"\"\",\n",
    "                    ticket_number=r[0], start_date=r[1], due_date=r[2], return_status=r[3],\n",
    "                    return_fee=r[4], refund_total=r[5], order_number=r[6]\n",
    "                )\n",
    "\n",
    "ret_pop = PopulateReturn(uri, username, password)\n",
    "ret_pop.populate_return()\n",
    "ret_pop.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### B.10 Populate Entity Delivery"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "class PopulateDelivery:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "    def populate_delivery(self):\n",
    "        deliveries = [\n",
    "            (981234567, '2024-01-20', 'Delivered', 'john.doe@gmail.com', 1),\n",
    "            (983456789, '2024-02-25', 'Delivered', 'jane.smith@outlook.com', 2),\n",
    "            (987654321, '2024-03-15', 'Delivered', 'alice.jones@gmail.com', 3),\n",
    "            (984321678, '2024-04-30', 'Pending', 'bob.brown@outlook.com', 4),\n",
    "            (986789012, '2024-06-04', 'Delivered', 'carol.white@outlook.com', 5),\n",
    "            (982345678, '2024-06-20', 'Pending', 'laura.green@gmail.com', 6),\n",
    "            (988765432, '2024-07-28', 'Delivered', 'chris.lee@outlook.com', 7),\n",
    "            (981234890, '2024-08-23', 'Delivered', 'emily.davis@gmail.com', 8),\n",
    "            (982234567, '2024-09-10', 'Delivered', 'michael.jordan@yahoo.com', 9),\n",
    "            (985678123, '2024-10-15', 'Pending', 'susan.martin@hotmail.com', 10),\n",
    "            (987654310, '2024-02-01', 'Delivered', 'nancy.parker@gmail.com', 11),\n",
    "            (981278456, '2024-03-20', 'Delivered', 'kevin.baker@gmail.com', 12),\n",
    "            (982344567, '2024-03-31', 'Delivered', 'patricia.scott@yahoo.com', 13),\n",
    "            (989876543, '2024-04-10', 'Pending', 'frank.harris@gmail.com', 14),\n",
    "            (983456721, '2024-06-10', 'Delivered', 'isabella.hernandez@gmail.com', 15),\n",
    "            (984567123, '2024-07-25', 'Delivered', 'ryan.carter@gmail.com', 16),\n",
    "            (988765412, '2024-08-02', 'Delivered', 'kimberly.allen@gmail.com', 17),\n",
    "            (981234678, '2024-08-20', 'Pending', 'hannah.collins@aol.com', 18),\n",
    "            (983456098, '2024-09-15', 'Delivered', 'thomas.anderson@outlook.com', 19),\n",
    "            (987123456, '2024-10-05', 'Pending', 'elizabeth.james@gmail.com', 20),\n",
    "            (984210987, '2024-01-24', 'Delivered', 'matthew.reed@hotmail.com', 21),\n",
    "            (983459876, '2024-02-17', 'Delivered', 'mark.adams@gmail.com', 22),\n",
    "            (982345091, '2024-03-20', 'Delivered', 'julia.moore@gmail.com', 23),\n",
    "            (981098765, '2024-05-01', 'Pending', 'sara.watson@outlook.com', 24),\n",
    "            (987098123, '2024-06-01', 'Delivered', 'timothy.hall@gmail.com', 25),\n",
    "            (983209874, '2024-06-10', 'Pending', 'julia.moore@gmail.com', 26),\n",
    "            (981230765, '2024-07-21', 'Delivered', 'joseph.cook@gmail.com', 27),\n",
    "            (982134590, '2024-08-25', 'Delivered', 'aaron.morris@yahoo.com', 28),\n",
    "            (984312098, '2024-09-15', 'Delivered', 'victoria.mitchell@gmail.com', 29),\n",
    "            (987654012, '2024-11-04', 'Pending', 'oliver.taylor@gmail.com', 30),\n",
    "            (981034256, '2024-01-17', 'Delivered', 'joseph.cook@gmail.com', 31),\n",
    "            (982345678, '2024-03-04', 'Delivered', 'michael.brown@gmail.com', 32),\n",
    "            (984567890, '2024-03-08', 'Delivered', 'maria.hill@gmail.com', 33),\n",
    "            (987651234, '2024-03-30', 'Delivered', 'diana.king@hotmail.com', 34),\n",
    "            (981234099, '2024-05-15', 'Pending', 'steven.wright@outlook.com', 35),\n",
    "            (983456072, '2024-06-29', 'Delivered', 'henry.young@gmail.com', 36),\n",
    "            (984567210, '2024-07-29', 'Pending', 'megan.foster@outlook.com', 37),\n",
    "            (982345167, '2024-08-21', 'Delivered', 'julia.moore@gmail.com', 38),\n",
    "            (987098657, '2024-09-18', 'Delivered', 'timothy.hall@gmail.com', 39),\n",
    "            (981276345, '2024-10-15', 'Pending', 'julia.moore@gmail.com', 40),\n",
    "            (982314567, '2024-11-10', 'Delivered', 'joseph.cook@gmail.com', 41),\n",
    "            (983457890, '2024-01-03', 'Delivered', 'thomas.anderson@outlook.com', 42),\n",
    "            (984210987, '2024-02-10', 'Pending', 'laura.green@gmail.com', 43),\n",
    "            (981034556, '2024-03-15', 'Delivered', 'kevin.baker@gmail.com', 44),\n",
    "            (983209876, '2024-04-18', 'Delivered', 'sara.watson@outlook.com', 45),\n",
    "            (982134578, '2024-06-01', 'Delivered', 'frank.harris@gmail.com', 46)\n",
    "        ]\n",
    "        with self.driver.session() as session:\n",
    "            for d in deliveries:\n",
    "                session.run(\n",
    "                    \"\"\"\n",
    "                    MERGE (del:Delivery {track_number:$track_number})\n",
    "                    ON CREATE SET del.date_of_delivery=$date_of_delivery, del.delivery_status=$delivery_status,\n",
    "                                  del.customer_email=$email, del.order_number=$order_number\n",
    "                    \"\"\",\n",
    "                    track_number=d[0], date_of_delivery=d[1], delivery_status=d[2],\n",
    "                    email=d[3], order_number=d[4]\n",
    "                )\n",
    "\n",
    "del_pop = PopulateDelivery(uri, username, password)\n",
    "del_pop.populate_delivery()\n",
    "del_pop.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### B.11 Populate Entity Review"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "class PopulateReviews:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "    def populate_reviews(self):\n",
    "        reviews = [\n",
    "            (401, '2024-01-15', 'Great product, very satisfied!', 5, 'chris.lee@outlook.com', 50053),\n",
    "            (402, '2024-01-17', 'Not worth the price, very disappointed.', 2, 'julia.moore@gmail.com', 50072),\n",
    "            (403, '2024-01-19', 'Average quality, okay for the price.', 3, 'kevin.baker@gmail.com', 50011),\n",
    "            (404, '2024-01-20', 'Fantastic! Exceeded my expectations.', 5, 'bob.brown@outlook.com', 50004),\n",
    "            (405, '2024-01-22', 'Broke after a week, very poor quality.', 1, 'michael.jordan@yahoo.com', 50009),\n",
    "            (406, '2024-01-24', 'I love it! Will buy again.', 4, 'steven.wright@outlook.com', 50035),\n",
    "            (407, '2024-01-26', 'Not bad, does the job.', 3, 'maria.hill@gmail.com', 50033),\n",
    "            (408, '2024-01-28', 'Very stylish and functional!', 5, 'emily.davis@gmail.com', 50008),\n",
    "            (409, '2024-01-30', 'Terrible customer service experience.', 1, 'kimberly.allen@gmail.com', 50017),\n",
    "            (410, '2024-02-01', 'Would not recommend, had issues.', 2, 'sara.watson@outlook.com', 50070),\n",
    "            (411, '2024-02-03', 'Best purchase I’ve made this year!', 5, 'sara.watson@outlook.com', 50045),\n",
    "            (412, '2024-02-05', 'Just okay, nothing special.', 3, 'sara.watson@outlook.com', 50091)\n",
    "        ]\n",
    "        with self.driver.session() as session:\n",
    "            for rev in reviews:\n",
    "                session.run(\n",
    "                    \"\"\"\n",
    "                    MERGE (r:Review {review_number:$review_number})\n",
    "                    ON CREATE SET r.review_date=$review_date, r.review_text=$review_text, r.ranking=$ranking,\n",
    "                                  r.email=$email, r.product_number=$product_number\n",
    "                    \"\"\",\n",
    "                    review_number=rev[0], review_date=rev[1], review_text=rev[2], ranking=rev[3],\n",
    "                    email=rev[4], product_number=rev[5]\n",
    "                )\n",
    "\n",
    "rev_pop = PopulateReviews(uri, username, password)\n",
    "rev_pop.populate_reviews()\n",
    "rev_pop.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### B.12 Populate OrderedItem"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "class PopulateOrderedItems:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "    def populate_ordered_items(self):\n",
    "        ordered_items = [\n",
    "            (3001, 1, 50001, 1),\n",
    "            (3002, 1, 50047, 1),\n",
    "            (3003, 2, 50002, 1),\n",
    "            (3004, 2, 50048, 1),\n",
    "            (3005, 3, 50003, 1),\n",
    "            (3006, 3, 50049, 1),\n",
    "            (3007, 4, 50004, 1),\n",
    "            (3008, 4, 50050, 1),\n",
    "            (3009, 5, 50005, 2),\n",
    "            (3010, 5, 50051, 1),\n",
    "            (3011, 6, 50006, 1),\n",
    "            (3012, 6, 50052, 3),\n",
    "            (3013, 7, 50007, 4),\n",
    "            (3014, 7, 50053, 1),\n",
    "            (3015, 7, 50098, 1),\n",
    "            (3016, 8, 50008, 1),\n",
    "            (3017, 8, 50054, 1),\n",
    "            (3018, 9, 50009, 1),\n",
    "            (3019, 9, 50055, 1),\n",
    "            (3020, 9, 50100, 1),\n",
    "            (3021, 10, 50010, 1),\n",
    "            (3022, 10, 50056, 1),\n",
    "            (3023, 11, 50011, 1),\n",
    "            (3024, 11, 50057, 1),\n",
    "            (3025, 11, 50099, 2),\n",
    "            (3026, 12, 50012, 1),\n",
    "            (3027, 12, 50058, 1),\n",
    "            (3028, 13, 50013, 1),\n",
    "            (3029, 13, 50059, 1),\n",
    "            (3030, 14, 50014, 1),\n",
    "            (3031, 14, 50060, 1),\n",
    "            (3032, 15, 50015, 1),\n",
    "            (3033, 15, 50061, 1),\n",
    "            (3034, 16, 50016, 2),\n",
    "            (3035, 16, 50062, 1),\n",
    "            (3036, 17, 50017, 1),\n",
    "            (3037, 17, 50063, 1),\n",
    "            (3038, 18, 50018, 1),\n",
    "            (3039, 18, 50064, 1),\n",
    "            (3040, 19, 50019, 1),\n",
    "            (3041, 19, 50065, 1),\n",
    "            (3042, 20, 50020, 4),\n",
    "            (3043, 20, 50066, 1),\n",
    "            (3044, 20, 50097, 1),\n",
    "            (3045, 21, 50021, 1),\n",
    "            (3046, 21, 50067, 1),\n",
    "            (3047, 22, 50022, 1),\n",
    "            (3048, 22, 50068, 1),\n",
    "            (3049, 23, 50023, 1),\n",
    "            (3050, 23, 50069, 1),\n",
    "            (3051, 24, 50024, 1),\n",
    "            (3052, 24, 50070, 1),\n",
    "            (3053, 25, 50025, 1),\n",
    "            (3054, 25, 50071, 2),\n",
    "            (3055, 25, 50095, 1),\n",
    "            (3056, 26, 50026, 1),\n",
    "            (3057, 26, 50072, 1),\n",
    "            (3058, 27, 50027, 1),\n",
    "            (3059, 27, 50073, 1),\n",
    "            (3060, 28, 50028, 1),\n",
    "            (3061, 28, 50074, 1),\n",
    "            (3062, 29, 50029, 1),\n",
    "            (3063, 29, 50075, 1),\n",
    "            (3064, 29, 50032, 1),\n",
    "            (3065, 30, 50030, 1),\n",
    "            (3066, 30, 50076, 1),\n",
    "            (3067, 31, 50031, 1),\n",
    "            (3068, 31, 50077, 1),\n",
    "            (3069, 32, 50032, 1),\n",
    "            (3070, 32, 50078, 1),\n",
    "            (3071, 33, 50033, 1),\n",
    "            (3072, 33, 50079, 1),\n",
    "            (3073, 34, 50034, 1),\n",
    "            (3074, 34, 50080, 1),\n",
    "            (3075, 35, 50035, 1),\n",
    "            (3076, 35, 50081, 1),\n",
    "            (3077, 36, 50036, 1),\n",
    "            (3078, 36, 50082, 1),\n",
    "            (3079, 37, 50037, 3),\n",
    "            (3080, 37, 50083, 1),\n",
    "            (3081, 37, 50094, 2),\n",
    "            (3082, 38, 50038, 1),\n",
    "            (3083, 38, 50084, 1),\n",
    "            (3084, 39, 50039, 1),\n",
    "            (3085, 39, 50085, 1),\n",
    "            (3086, 40, 50040, 1),\n",
    "            (3087, 40, 50086, 1),\n",
    "            (3088, 41, 50041, 1),\n",
    "            (3089, 41, 50087, 1),\n",
    "            (3090, 41, 50093, 1),\n",
    "            (3091, 42, 50042, 1),\n",
    "            (3092, 42, 50088, 1),\n",
    "            (3093, 43, 50043, 1),\n",
    "            (3094, 43, 50089, 1),\n",
    "            (3095, 44, 50044, 1),\n",
    "            (3096, 44, 50090, 1),\n",
    "            (3097, 45, 50045, 1),\n",
    "            (3098, 45, 50091, 1),\n",
    "            (3099, 46, 50046, 1),\n",
    "            (3100, 46, 50092, 1)\n",
    "        ]\n",
    "        with self.driver.session() as session:\n",
    "            for oi in ordered_items:\n",
    "                session.run(\n",
    "                    \"\"\"\n",
    "                    MERGE (oitem:OrderedItem {ordered_item_id:$oid})\n",
    "                    ON CREATE SET oitem.order_number=$order_number, oitem.product_number=$product_number,\n",
    "                                  oitem.ordered_quantity=$ordered_quantity\n",
    "                    \"\"\",\n",
    "                    oid=oi[0], order_number=oi[1], product_number=oi[2], ordered_quantity=oi[3]\n",
    "                )\n",
    "\n",
    "oi_pop = PopulateOrderedItems(uri, username, password)\n",
    "oi_pop.populate_ordered_items()\n",
    "oi_pop.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### **B.13 Create Relationships**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "class PopulateRelationships:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "\n",
    "    def create_relationships(self):\n",
    "        with self.driver.session() as session:\n",
    "            # Customer-Order\n",
    "            session.run(\"\"\"\n",
    "            MATCH (c:Customer), (o:Order)\n",
    "            WHERE o.customer_email = c.email\n",
    "            MERGE (c)-[:PLACE]->(o)\n",
    "            \"\"\")\n",
    "\n",
    "            # Customer-Wishlist\n",
    "            session.run(\"\"\"\n",
    "            MATCH (c:Customer), (w:Wishlist)\n",
    "            WHERE w.customer_email = c.email\n",
    "            MERGE (c)-[:REGISTERS_FOR]->(w)\n",
    "            \"\"\")\n",
    "\n",
    "            # PaymentMethod-Order & PaymentMethod-Customer\n",
    "            session.run(\"\"\"\n",
    "            MATCH (c:Customer), (o:Order), (pm:PaymentMethod)\n",
    "            WHERE pm.order_number = o.order_number AND pm.customer_email = c.email\n",
    "            MERGE (o)-[:IS_PAID_BY]->(pm)\n",
    "            MERGE (c)-[:USES]->(pm)\n",
    "            \"\"\")\n",
    "\n",
    "            # CreditCard-PaymentMethod\n",
    "            session.run(\"\"\"\n",
    "            MATCH (pm:PaymentMethod), (cc:CreditCard)\n",
    "            WHERE cc.payment_method_id = pm.payment_method_id\n",
    "            MERGE (pm)-[:USES]->(cc)\n",
    "            \"\"\")\n",
    "\n",
    "            # GiftCard-PaymentMethod\n",
    "            session.run(\"\"\"\n",
    "            MATCH (pm:PaymentMethod), (gc:GiftCard)\n",
    "            WHERE gc.payment_method_id = pm.payment_method_id\n",
    "            MERGE (pm)-[:USES]->(gc)\n",
    "            \"\"\")\n",
    "\n",
    "            # Order-OrderedItem\n",
    "            session.run(\"\"\"\n",
    "            MATCH (o:Order), (oi:OrderedItem)\n",
    "            WHERE oi.order_number = o.order_number\n",
    "            MERGE (o)-[:CONTAINS]->(oi)\n",
    "            \"\"\")\n",
    "\n",
    "            # OrderedItem-Product\n",
    "            session.run(\"\"\"\n",
    "            MATCH (oi:OrderedItem), (p:Product)\n",
    "            WHERE oi.product_number = p.product_number\n",
    "            MERGE (oi)-[:IS]->(p)\n",
    "            \"\"\")\n",
    "\n",
    "            # Product-Category\n",
    "            session.run(\"\"\"\n",
    "            MATCH (p:Product), (cat:Category)\n",
    "            WHERE p.category_id = cat.category_id\n",
    "            MERGE (p)-[:BELONGS_TO]->(cat)\n",
    "            \"\"\")\n",
    "\n",
    "            # Delivery-Customer and Delivery-Order\n",
    "            session.run(\"\"\"\n",
    "            MATCH (d:Delivery), (c:Customer), (o:Order)\n",
    "            WHERE d.customer_email = c.email AND d.order_number = o.order_number\n",
    "            MERGE (d)-[:DELIVERS_TO]->(c)\n",
    "            MERGE (d)-[:IS_GENERATED_BY]->(o)\n",
    "            \"\"\")\n",
    "\n",
    "            # Return-Order\n",
    "            session.run(\"\"\"\n",
    "            MATCH (r:Return), (o:Order)\n",
    "            WHERE r.order_number = o.order_number\n",
    "            MERGE (r)-[:IS_RETURNED]->(o)\n",
    "            \"\"\")\n",
    "\n",
    "            # If product has ticket_number (return), link product to return\n",
    "            session.run(\"\"\"\n",
    "            MATCH (p:Product), (r:Return)\n",
    "            WHERE p.ticket_number = r.ticket_number\n",
    "            MERGE (r)-[:IS_RETURNED_FOR]->(p)\n",
    "            \"\"\")\n",
    "\n",
    "            # Product-Wishlist if wishlist_id not null\n",
    "            session.run(\"\"\"\n",
    "            MATCH (p:Product), (w:Wishlist)\n",
    "            WHERE p.wishlist_id = w.wishlist_id\n",
    "            MERGE (w)-[:CONTAINS]->(p)\n",
    "            \"\"\")\n",
    "\n",
    "            # Review-Customer and Review-Product\n",
    "            session.run(\"\"\"\n",
    "            MATCH (rev:Review), (c:Customer), (p:Product)\n",
    "            WHERE rev.email = c.email AND rev.product_number = p.product_number\n",
    "            MERGE (c)-[:WRITES]->(rev)\n",
    "            MERGE (rev)-[:IS_WRITTEN_FOR]->(p)\n",
    "            \"\"\")\n",
    "\n",
    "rel_pop = PopulateRelationships(uri, username, password)\n",
    "rel_pop.create_relationships()\n",
    "rel_pop.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### B.14 The screenshot of my neo4j database:\n",
    "I use this Cypher query to display all outputs  \n",
    "MATCH (n)-[r]->(m)  \n",
    "RETURN n, r, m  \n",
    "\n",
    "(sometimes the image is not properly displayed on Github, you may want to download the repository as .zip and open this notebook in vscode. Otherwise, check the file named \"48372_Q2B_ScreenShot_of_neo4j\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "![Alt Text](48372_Q2B_ScreenShot_of_neo4j.png)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### **Question (C)/(2C)**\n",
    "##### I need to produce a list of all customers and their orders, including the list of products in each order and the (grand) total paid. Followed by showing the customer’s name,email, order number, and order date.  \n",
    "\n",
    "##### First, I will look into which tables contains the information I need, and for this query, they are **Customer, Order, OrderedItem, and Product**. Thus, I will use Cypher language **MATCH** to \"link\" them together.\n",
    "##### Then I just need to get all information I need by using **RETURN**. For most information I can directly refer to properties inside nodes. However, since I need to produce a list of products purchased, and the list does not initially exist, I will aggregate all **short_name** properties by **COLLECT()** to produce a list.\n",
    "##### Finally, group them by the alphabet sequence From A to Z.\n",
    "\n",
    "##### By comparing the answer I get here to the answer I get from first assignment using SQL, I can confirm that this is the right approach."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Customer Name: Aaron Morris\n",
      "Customer Email: aaron.morris@yahoo.com\n",
      "Order Number: 28\n",
      "Order Date: 2024-08-22\n",
      "Products: ['Tennis Racket', 'Camping Stove']\n",
      "Grand Total: 155.18\n",
      "----------------------------------------\n",
      "Customer Name: Alice Jones\n",
      "Customer Email: alice.jones@gmail.com\n",
      "Order Number: 3\n",
      "Order Date: 2024-03-10\n",
      "Products: ['Headphones', 'Desk']\n",
      "Grand Total: 499.98\n",
      "----------------------------------------\n",
      "Customer Name: Bob Brown\n",
      "Customer Email: bob.brown@outlook.com\n",
      "Order Number: 4\n",
      "Order Date: 2024-04-25\n",
      "Products: ['Microwave Oven', 'Tablet']\n",
      "Grand Total: 407.98\n",
      "----------------------------------------\n",
      "Customer Name: Carol White\n",
      "Customer Email: carol.white@outlook.com\n",
      "Order Number: 5\n",
      "Order Date: 2024-05-30\n",
      "Products: ['Blender', 'Garden Chair']\n",
      "Grand Total: 228.98\n",
      "----------------------------------------\n",
      "Customer Name: Chris Lee\n",
      "Customer Email: chris.lee@outlook.com\n",
      "Order Number: 7\n",
      "Order Date: 2024-07-22\n",
      "Products: ['Sofa', 'Baking Set', 'Playmat']\n",
      "Grand Total: 1982.593\n",
      "----------------------------------------\n",
      "Customer Name: Diana King\n",
      "Customer Email: diana.king@hotmail.com\n",
      "Order Number: 34\n",
      "Order Date: 2024-03-28\n",
      "Products: ['Leather Jacket', 'Portable Charger']\n",
      "Grand Total: 229.98\n",
      "----------------------------------------\n",
      "Customer Name: Elizabeth James\n",
      "Customer Email: elizabeth.james@gmail.com\n",
      "Order Number: 20\n",
      "Order Date: 2024-10-02\n",
      "Products: ['Camping Lantern', 'Smart Home Hub', 'Baby Clothes']\n",
      "Grand Total: 242.95\n",
      "----------------------------------------\n",
      "Customer Name: Emily Davis\n",
      "Customer Email: emily.davis@gmail.com\n",
      "Order Number: 8\n",
      "Order Date: 2024-08-18\n",
      "Products: ['Coffee Table', 'Electric Toothbrush']\n",
      "Grand Total: 269.98\n",
      "----------------------------------------\n",
      "Customer Name: Frank Harris\n",
      "Customer Email: frank.harris@gmail.com\n",
      "Order Number: 14\n",
      "Order Date: 2024-04-05\n",
      "Products: ['Fiction Novel', 'Window Blinds']\n",
      "Grand Total: 64.98\n",
      "----------------------------------------\n",
      "Customer Name: Frank Harris\n",
      "Customer Email: frank.harris@gmail.com\n",
      "Order Number: 46\n",
      "Order Date: 2024-05-20\n",
      "Products: ['Wireless Mouse', 'Toddler Shoes']\n",
      "Grand Total: 53.98\n",
      "----------------------------------------\n",
      "Customer Name: Hannah Collins\n",
      "Customer Email: hannah.collins@aol.com\n",
      "Order Number: 18\n",
      "Order Date: 2024-08-12\n",
      "Products: ['Car Seat Cover', 'E-Reader']\n",
      "Grand Total: 170.98\n",
      "----------------------------------------\n",
      "Customer Name: Henry Young\n",
      "Customer Email: henry.young@gmail.com\n",
      "Order Number: 36\n",
      "Order Date: 2024-05-13\n",
      "Products: ['Wireless Charger', 'Smartphone Case']\n",
      "Grand Total: 56.98\n",
      "----------------------------------------\n",
      "Customer Name: Isabella Hernandez\n",
      "Customer Email: isabella.hernandez@gmail.com\n",
      "Order Number: 15\n",
      "Order Date: 2024-05-11\n",
      "Products: ['Fitness Tracker', 'Air Fryer']\n",
      "Grand Total: 239.98\n",
      "----------------------------------------\n",
      "Customer Name: Jane Smith\n",
      "Customer Email: jane.smith@outlook.com\n",
      "Order Number: 2\n",
      "Order Date: 2024-02-20\n",
      "Products: ['Laptop', 'Smart Speaker']\n",
      "Grand Total: 1259.98\n",
      "----------------------------------------\n",
      "Customer Name: Joseph Cook\n",
      "Customer Email: joseph.cook@gmail.com\n",
      "Order Number: 27\n",
      "Order Date: 2024-07-18\n",
      "Products: ['Cookbook', 'Outdoor Grill']\n",
      "Grand Total: 263.98\n",
      "----------------------------------------\n",
      "Customer Name: Joseph Cook\n",
      "Customer Email: joseph.cook@gmail.com\n",
      "Order Number: 31\n",
      "Order Date: 2024-01-12\n",
      "Products: ['Tent', 'Fishing Tackle Box']\n",
      "Grand Total: 158.08\n",
      "----------------------------------------\n",
      "Customer Name: Joseph Cook\n",
      "Customer Email: joseph.cook@gmail.com\n",
      "Order Number: 41\n",
      "Order Date: 2024-10-15\n",
      "Products: ['Notebook', 'Stroller', 'Kids Art Set']\n",
      "Grand Total: 234.97\n",
      "----------------------------------------\n",
      "Customer Name: Julia Moore\n",
      "Customer Email: julia.moore@gmail.com\n",
      "Order Number: 23\n",
      "Order Date: 2024-03-16\n",
      "Products: ['Vacuum Cleaner', 'Hammer']\n",
      "Grand Total: 299.23\n",
      "----------------------------------------\n",
      "Customer Name: Julia Moore\n",
      "Customer Email: julia.moore@gmail.com\n",
      "Order Number: 26\n",
      "Order Date: 2024-06-05\n",
      "Products: ['Frying Pan', 'Patio Table']\n",
      "Grand Total: 211.58\n",
      "----------------------------------------\n",
      "Customer Name: Julia Moore\n",
      "Customer Email: julia.moore@gmail.com\n",
      "Order Number: 38\n",
      "Order Date: 2024-07-20\n",
      "Products: ['Hair Dryer', 'Puzzle Mat']\n",
      "Grand Total: 67.98\n",
      "----------------------------------------\n",
      "Customer Name: Julia Moore\n",
      "Customer Email: julia.moore@gmail.com\n",
      "Order Number: 40\n",
      "Order Date: 2024-09-29\n",
      "Products: ['Vitamins', 'Kids Bike']\n",
      "Grand Total: 95.98\n",
      "----------------------------------------\n",
      "Customer Name: Kevin Baker\n",
      "Customer Email: kevin.baker@gmail.com\n",
      "Order Number: 12\n",
      "Order Date: 2024-02-15\n",
      "Products: ['Sunscreen', 'Bluetooth Speaker']\n",
      "Grand Total: 91.98\n",
      "----------------------------------------\n",
      "Customer Name: Kevin Baker\n",
      "Customer Email: kevin.baker@gmail.com\n",
      "Order Number: 44\n",
      "Order Date: 2024-03-08\n",
      "Products: ['Router', 'Kids Tablet']\n",
      "Grand Total: 170.98\n",
      "----------------------------------------\n",
      "Customer Name: Kimberly Allen\n",
      "Customer Email: kimberly.allen@gmail.com\n",
      "Order Number: 17\n",
      "Order Date: 2024-07-21\n",
      "Products: ['Board Game', 'Drone']\n",
      "Grand Total: 334.98\n",
      "----------------------------------------\n",
      "Customer Name: Laura Green\n",
      "Customer Email: laura.green@gmail.com\n",
      "Order Number: 6\n",
      "Order Date: 2024-06-15\n",
      "Products: ['Refrigerator', 'Smart Bulb']\n",
      "Grand Total: 1087.97\n",
      "----------------------------------------\n",
      "Customer Name: Laura Green\n",
      "Customer Email: laura.green@gmail.com\n",
      "Order Number: 43\n",
      "Order Date: 2024-02-05\n",
      "Products: ['Office Chair', 'Diaper Bag']\n",
      "Grand Total: 161.98\n",
      "----------------------------------------\n",
      "Customer Name: Maria Hill\n",
      "Customer Email: maria.hill@gmail.com\n",
      "Order Number: 33\n",
      "Order Date: 2024-03-01\n",
      "Products: ['GPS Device', 'Camping Hammock']\n",
      "Grand Total: 119.98\n",
      "----------------------------------------\n",
      "Customer Name: Mark Adams\n",
      "Customer Email: mark.adams@gmail.com\n",
      "Order Number: 22\n",
      "Order Date: 2024-02-14\n",
      "Products: ['Washing Machine', 'Cordless Drill']\n",
      "Grand Total: 756.48\n",
      "----------------------------------------\n",
      "Customer Name: Matthew Reed\n",
      "Customer Email: matthew.reed@hotmail.com\n",
      "Order Number: 21\n",
      "Order Date: 2024-01-19\n",
      "Products: ['Action Camera', 'Webcam']\n",
      "Grand Total: 249.98\n",
      "----------------------------------------\n",
      "Customer Name: Megan Foster\n",
      "Customer Email: megan.foster@outlook.com\n",
      "Order Number: 37\n",
      "Order Date: 2024-06-25\n",
      "Products: ['Puzzle', 'Action Figure', 'Kids Bed']\n",
      "Grand Total: 583.94\n",
      "----------------------------------------\n",
      "Customer Name: Michael Brown\n",
      "Customer Email: michael.brown@gmail.com\n",
      "Order Number: 32\n",
      "Order Date: 2024-02-28\n",
      "Products: ['Sleeping Bag', 'Thermos Flask']\n",
      "Grand Total: 89.98\n",
      "----------------------------------------\n",
      "Customer Name: Michael Jordan\n",
      "Customer Email: michael.jordan@yahoo.com\n",
      "Order Number: 9\n",
      "Order Date: 2024-09-05\n",
      "Products: ['T-Shirt', 'Home Security Camera', 'Kids Bike Accessories']\n",
      "Grand Total: 129.97\n",
      "----------------------------------------\n",
      "Customer Name: Nancy Parker\n",
      "Customer Email: nancy.parker@gmail.com\n",
      "Order Number: 11\n",
      "Order Date: 2024-01-22\n",
      "Products: ['Watch', 'Air Conditioner', 'Kids Swim Set']\n",
      "Grand Total: 1037.98\n",
      "----------------------------------------\n",
      "Customer Name: Oliver Taylor\n",
      "Customer Email: oliver.taylor@gmail.com\n",
      "Order Number: 30\n",
      "Order Date: 2024-10-30\n",
      "Products: ['Bicycle', 'Inflatable Kayak']\n",
      "Grand Total: 629.98\n",
      "----------------------------------------\n",
      "Customer Name: Patricia Scott\n",
      "Customer Email: patricia.scott@yahoo.com\n",
      "Order Number: 13\n",
      "Order Date: 2024-03-30\n",
      "Products: ['Yoga Mat', 'Electric Fan']\n",
      "Grand Total: 77.58\n",
      "----------------------------------------\n",
      "Customer Name: Ryan Carter\n",
      "Customer Email: ryan.carter@gmail.com\n",
      "Order Number: 16\n",
      "Order Date: 2024-06-18\n",
      "Products: ['Soccer Ball', 'Pressure Cooker']\n",
      "Grand Total: 125.97\n",
      "----------------------------------------\n",
      "Customer Name: Sara Watson\n",
      "Customer Email: sara.watson@outlook.com\n",
      "Order Number: 24\n",
      "Order Date: 2024-04-20\n",
      "Products: ['Coffee Maker', 'Tape Measure']\n",
      "Grand Total: 79.18\n",
      "----------------------------------------\n",
      "Customer Name: Sara Watson\n",
      "Customer Email: sara.watson@outlook.com\n",
      "Order Number: 45\n",
      "Order Date: 2024-04-15\n",
      "Products: ['Video Game', 'Activity Gym']\n",
      "Grand Total: 109.99\n",
      "----------------------------------------\n",
      "Customer Name: Steven Wright\n",
      "Customer Email: steven.wright@outlook.com\n",
      "Order Number: 35\n",
      "Order Date: 2024-04-10\n",
      "Products: ['Smart Watch', 'Leather Wallet']\n",
      "Grand Total: 275.98\n",
      "----------------------------------------\n",
      "Customer Name: Susan Martin\n",
      "Customer Email: susan.martin@hotmail.com\n",
      "Order Number: 10\n",
      "Order Date: 2024-10-10\n",
      "Products: ['Jeans', 'Heater']\n",
      "Grand Total: 142.49\n",
      "----------------------------------------\n",
      "Customer Name: Thomas Anderson\n",
      "Customer Email: thomas.anderson@outlook.com\n",
      "Order Number: 19\n",
      "Order Date: 2024-09-07\n",
      "Products: ['Garden Tools Set', 'Video Projector']\n",
      "Grand Total: 520.78\n",
      "----------------------------------------\n",
      "Customer Name: Thomas Anderson\n",
      "Customer Email: thomas.anderson@outlook.com\n",
      "Order Number: 42\n",
      "Order Date: 2024-01-01\n",
      "Products: ['Printer', 'Baby Monitor']\n",
      "Grand Total: 195.99\n",
      "----------------------------------------\n",
      "Customer Name: Timothy Hall\n",
      "Customer Email: timothy.hall@gmail.com\n",
      "Order Number: 25\n",
      "Order Date: 2024-05-25\n",
      "Products: ['Electric Kettle', 'Garden Hose', 'Bike Helmet']\n",
      "Grand Total: 129.96\n",
      "----------------------------------------\n",
      "Customer Name: Timothy Hall\n",
      "Customer Email: timothy.hall@gmail.com\n",
      "Order Number: 39\n",
      "Order Date: 2024-08-14\n",
      "Products: ['Face Cream', 'Balloon Set']\n",
      "Grand Total: 37.98\n",
      "----------------------------------------\n",
      "Customer Name: Victoria Mitchell\n",
      "Customer Email: victoria.mitchell@gmail.com\n",
      "Order Number: 29\n",
      "Order Date: 2024-09-11\n",
      "Products: ['Fishing Rod', 'Hiking Backpack', 'Sleeping Bag']\n",
      "Grand Total: 151.97\n",
      "----------------------------------------\n"
     ]
    }
   ],
   "source": [
    "driver = GraphDatabase.driver(uri, auth=(username, password))\n",
    "\n",
    "def list_customers_orders_products(driver):\n",
    "    query = \"\"\"\n",
    "    MATCH (c:Customer)-[:PLACE]->(o:Order)-[:CONTAINS]->(oi:OrderedItem)-[:IS]->(p:Product)\n",
    "    WITH c, o, COLLECT(p.short_name) AS products\n",
    "    RETURN c.name AS CustomerName, \n",
    "           c.email AS CustomerEmail, \n",
    "           o.order_number AS OrderNumber, \n",
    "           o.order_date AS OrderDate, \n",
    "           products AS Products, \n",
    "           o.grand_total AS GrandTotal\n",
    "    ORDER BY CustomerName\n",
    "    \"\"\"\n",
    "\n",
    "    with driver.session() as session:\n",
    "        results = session.run(query)\n",
    "        for record in results:\n",
    "            print(\"Customer Name:\", record[\"CustomerName\"])\n",
    "            print(\"Customer Email:\", record[\"CustomerEmail\"])\n",
    "            print(\"Order Number:\", record[\"OrderNumber\"])\n",
    "            print(\"Order Date:\", record[\"OrderDate\"])\n",
    "            print(\"Products:\", record[\"Products\"])\n",
    "            print(\"Grand Total:\", record[\"GrandTotal\"])\n",
    "# use - to bloack different sections.\n",
    "            print(\"-\" * 40)\n",
    "\n",
    "list_customers_orders_products(driver)\n",
    "driver.close()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### **Question (D)/(2D)**\n",
    "##### In this question, I am required to list the e-mail, name, birthday, gift card balance, and list of products in baskets from customers who have items in their baskets. To fulfill this demand, I need the information from table Customer, Wishlist and Product. Like question C, I will link them together.  \n",
    "##### Also following the same logic in the question c, I create a list of products. But this time, I only need to create lists for products inside wishlists. Thus, I will use **p.wishlist_id = w.wishlist_id** to only include those products. \n",
    "##### I also need to find out the gift card balances (if there is any). Since **some customers have wishlists but do not possess gift cards**, I will default NULL output into 0 by **SUM(gc.current_balances),0)**. Of course, if a customer has gift card, the value will be printed. \n",
    "\n",
    "\n",
    "##### By comparing the answer I get here to the answer I get from first assignment using SQL, I can confirm that this is the right approach."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.AggregationSkippedNull} {category: UNRECOGNIZED} {title: The query contains an aggregation function that skips null values.} {description: null value eliminated in set function.} {position: None} for query: '\\n    MATCH (c:Customer)-[:REGISTERS_FOR]->(w:Wishlist)\\n    MATCH (p:Product)\\n    WHERE p.wishlist_id = w.wishlist_id\\n    WITH c, w, COLLECT(p.short_name) AS products\\n    OPTIONAL MATCH (c)-[:USES]->(:PaymentMethod)-[:USES]->(gc:GiftCard)\\n    WITH c, products, COALESCE(SUM(gc.current_balances),0) AS GiftCardBalance\\n    RETURN c.email AS Email,\\n           c.name AS Name,\\n           c.birthdate AS Birthdate,\\n           GiftCardBalance,\\n           products AS Products\\n    ORDER BY Name\\n    '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Email: carol.white@outlook.com\n",
      "Name: Carol White\n",
      "Birthdate: 1995-11-20\n",
      "GiftCardBalance: 0\n",
      "Products in Basket: ['Smartphone Case']\n",
      "----------------------------------------\n",
      "Email: elizabeth.james@gmail.com\n",
      "Name: Elizabeth James\n",
      "Birthdate: 1991-10-30\n",
      "GiftCardBalance: 0\n",
      "Products in Basket: ['Smartphone', 'Cordless Drill']\n",
      "----------------------------------------\n",
      "Email: emily.davis@gmail.com\n",
      "Name: Emily Davis\n",
      "Birthdate: 1992-12-08\n",
      "GiftCardBalance: 0\n",
      "Products in Basket: ['Headphones', 'Fiction Novel', 'Air Conditioner']\n",
      "----------------------------------------\n",
      "Email: frank.harris@gmail.com\n",
      "Name: Frank Harris\n",
      "Birthdate: 1980-04-14\n",
      "GiftCardBalance: 1900.0\n",
      "Products in Basket: ['Sunscreen', 'Vitamins']\n",
      "----------------------------------------\n",
      "Email: hannah.collins@aol.com\n",
      "Name: Hannah Collins\n",
      "Birthdate: 1989-12-20\n",
      "GiftCardBalance: 0\n",
      "Products in Basket: ['Smart Home Hub']\n",
      "----------------------------------------\n",
      "Email: isabella.hernandez@gmail.com\n",
      "Name: Isabella Hernandez\n",
      "Birthdate: 1995-02-06\n",
      "GiftCardBalance: 0\n",
      "Products in Basket: ['Face Cream', 'Air Fryer']\n",
      "----------------------------------------\n",
      "Email: isabella.hernandez@gmail.com\n",
      "Name: Isabella Hernandez\n",
      "Birthdate: 1995-02-06\n",
      "GiftCardBalance: 0\n",
      "Products in Basket: ['Inflatable Kayak']\n",
      "----------------------------------------\n",
      "Email: julia.moore@gmail.com\n",
      "Name: Julia Moore\n",
      "Birthdate: 1991-01-11\n",
      "GiftCardBalance: 9000.0\n",
      "Products in Basket: ['Laptop', 'Sofa', 'Watch', 'Fitness Tracker', 'Board Game', 'Action Camera', 'Coffee Maker', 'Frying Pan', 'Tent', 'Smart Watch', 'Office Chair', 'Desk', 'Baking Set', 'Bluetooth Speaker', 'Pressure Cooker', 'Webcam', 'Garden Hose', 'Patio Table', 'Hiking Backpack', 'Action Figure', 'Baby Monitor', 'Kids Art Set', 'Baby Clothes', 'Kids Bike Accessories']\n",
      "----------------------------------------\n",
      "Email: julia.moore@gmail.com\n",
      "Name: Julia Moore\n",
      "Birthdate: 1991-01-11\n",
      "GiftCardBalance: 9000.0\n",
      "Products in Basket: ['Soccer Ball', 'Kids Bed']\n",
      "----------------------------------------\n",
      "Email: julia.moore@gmail.com\n",
      "Name: Julia Moore\n",
      "Birthdate: 1991-01-11\n",
      "GiftCardBalance: 9000.0\n",
      "Products in Basket: ['Camping Hammock']\n",
      "----------------------------------------\n",
      "Email: kevin.baker@gmail.com\n",
      "Name: Kevin Baker\n",
      "Birthdate: 1987-12-04\n",
      "GiftCardBalance: 1200.5\n",
      "Products in Basket: ['Cookbook']\n",
      "----------------------------------------\n",
      "Email: kimberly.allen@gmail.com\n",
      "Name: Kimberly Allen\n",
      "Birthdate: 1995-10-21\n",
      "GiftCardBalance: 0\n",
      "Products in Basket: ['Refrigerator', 'Tablet']\n",
      "----------------------------------------\n",
      "Email: laura.green@gmail.com\n",
      "Name: Laura Green\n",
      "Birthdate: 1989-01-05\n",
      "GiftCardBalance: 5000.0\n",
      "Products in Basket: ['Kids Puzzle']\n",
      "----------------------------------------\n",
      "Email: michael.jordan@yahoo.com\n",
      "Name: Michael Jordan\n",
      "Birthdate: 1978-04-23\n",
      "GiftCardBalance: 0\n",
      "Products in Basket: ['Car Seat Cover', 'Electric Kettle']\n",
      "----------------------------------------\n",
      "Email: nancy.parker@gmail.com\n",
      "Name: Nancy Parker\n",
      "Birthdate: 1996-09-16\n",
      "GiftCardBalance: 0\n",
      "Products in Basket: ['Fishing Rod']\n",
      "----------------------------------------\n",
      "Email: ryan.carter@gmail.com\n",
      "Name: Ryan Carter\n",
      "Birthdate: 1976-08-03\n",
      "GiftCardBalance: 0\n",
      "Products in Basket: ['Smart Speaker']\n",
      "----------------------------------------\n",
      "Email: susan.martin@hotmail.com\n",
      "Name: Susan Martin\n",
      "Birthdate: 1993-06-10\n",
      "GiftCardBalance: 0\n",
      "Products in Basket: ['Coffee Table']\n",
      "----------------------------------------\n",
      "Email: thomas.anderson@outlook.com\n",
      "Name: Thomas Anderson\n",
      "Birthdate: 1983-11-12\n",
      "GiftCardBalance: 4500.0\n",
      "Products in Basket: ['Printer', 'Video Projector', 'Tape Measure']\n",
      "----------------------------------------\n",
      "Email: timothy.hall@gmail.com\n",
      "Name: Timothy Hall\n",
      "Birthdate: 1975-03-03\n",
      "GiftCardBalance: 5000.0\n",
      "Products in Basket: ['Microwave Oven', 'T-Shirt', 'Yoga Mat', 'Garden Tools Set', 'Washing Machine', 'Tennis Racket', 'Hair Dryer', 'Notebook', 'Video Game', 'Garden Chair', 'Home Security Camera', 'Window Blinds', 'E-Reader', 'Hammer', 'Outdoor Grill', 'Fishing Tackle Box', 'Portable Charger', 'Balloon Set', 'Activity Gym', 'Bike Helmet']\n",
      "----------------------------------------\n",
      "Email: timothy.hall@gmail.com\n",
      "Name: Timothy Hall\n",
      "Birthdate: 1975-03-03\n",
      "GiftCardBalance: 5000.0\n",
      "Products in Basket: ['Wireless Charger', 'Electric Toothbrush']\n",
      "----------------------------------------\n"
     ]
    }
   ],
   "source": [
    "driver = GraphDatabase.driver(uri, auth=(username, password))\n",
    "\n",
    "def list_customers_with_baskets_and_giftcards(driver):\n",
    "    query = \"\"\"\n",
    "    MATCH (c:Customer)-[:REGISTERS_FOR]->(w:Wishlist)\n",
    "    MATCH (p:Product)\n",
    "    WHERE p.wishlist_id = w.wishlist_id\n",
    "    WITH c, w, COLLECT(p.short_name) AS products\n",
    "    OPTIONAL MATCH (c)-[:USES]->(:PaymentMethod)-[:USES]->(gc:GiftCard)\n",
    "    WITH c, products, COALESCE(SUM(gc.current_balances),0) AS GiftCardBalance\n",
    "    RETURN c.email AS Email,\n",
    "           c.name AS CustomerName,\n",
    "           c.birthdate AS Birthdate,\n",
    "           GiftCardBalance,\n",
    "           products AS Products\n",
    "    ORDER BY CustomerName\n",
    "    \"\"\"\n",
    "\n",
    "    with driver.session() as session:\n",
    "        results = session.run(query)\n",
    "        for record in results:\n",
    "            print(\"Email:\", record[\"Email\"])\n",
    "            print(\"Name:\", record[\"Name\"])\n",
    "            print(\"Birthdate:\", record[\"Birthdate\"])\n",
    "            print(\"GiftCardBalance:\", record[\"GiftCardBalance\"])\n",
    "            print(\"Products in Basket:\", record[\"Products\"])\n",
    "# use - to bloack different sections.\n",
    "            print(\"-\" * 40)\n",
    "\n",
    "list_customers_with_baskets_and_giftcards(driver)\n",
    "driver.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### **Question (E)/(2E)**\n",
    "\n",
    "##### For this question, I will find the top 2 products that have most sales in their category. I will print their product names, corresponding category name and the exact number for their sales.\n",
    "\n",
    "##### By observing data structure, I know that these tables are needed: Category, Product, OrderedItem, and Order. I link them together.\n",
    "\n",
    "##### Then, I calculate the sales quantity of each product by summarizing the ordered_quantity of products from table OrderedItem. I set this as totalsold. After that, I will order them(products) with descending order from high sales quantity to low sales quantity.\n",
    "\n",
    "##### However, this is not finished. In the printout I need product names, category names, and sales. I can leave the category names aside, but I need to combine the product name and sales together because they are in a 1-to-1 relation. Every product needs their own sales. Thus, still using the same approach from previous questions, I combine them into a list: **COLLECT({productName: p.short_name, totalsold: totalsold})**, and I name it as ProductSales. Because I only need the first 2, so I **slice** the list ProductSales, and only leave the first 2 items: **productSales[0..2]**. I name this as TopTwoProducts.\n",
    "\n",
    "##### Finally, for interpretation, just to make it more visually friendly, I will print the category name, and then the 2 top sales products inside that category. This is done by a simple for loop. Apart from that, just like what I did in previous questions, I use \"-\" to split different sections.\n",
    "\n",
    "##### By comparing the answer I get here to the answer I get from first assignment using SQL, I can confirm that this is the right approach."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Category: Automotive\n",
      "  Product: Sleeping Bag, Units Sold: 2\n",
      "  Product: Car Seat Cover, Units Sold: 1\n",
      "----------------------------------------\n",
      "Category: Books\n",
      "  Product: Fiction Novel, Units Sold: 1\n",
      "  Product: Cookbook, Units Sold: 1\n",
      "----------------------------------------\n",
      "Category: Electronics\n",
      "  Product: Smartphone, Units Sold: 1\n",
      "  Product: Laptop, Units Sold: 1\n",
      "----------------------------------------\n",
      "Category: Fashion\n",
      "  Product: Refrigerator, Units Sold: 1\n",
      "  Product: T-Shirt, Units Sold: 1\n",
      "----------------------------------------\n",
      "Category: Furniture\n",
      "  Product: Sofa, Units Sold: 4\n",
      "  Product: Kids Bed, Units Sold: 2\n",
      "----------------------------------------\n",
      "Category: Health & Beauty\n",
      "  Product: Sunscreen, Units Sold: 1\n",
      "  Product: Hair Dryer, Units Sold: 1\n",
      "----------------------------------------\n",
      "Category: Home Appliances\n",
      "  Product: Smart Bulb, Units Sold: 3\n",
      "  Product: Blender, Units Sold: 2\n",
      "----------------------------------------\n",
      "Category: Jewelry & Accessories\n",
      "  Product: Watch, Units Sold: 1\n",
      "  Product: Smart Watch, Units Sold: 1\n",
      "----------------------------------------\n",
      "Category: Music & Entertainment\n",
      "  Product: Router, Units Sold: 1\n",
      "  Product: Video Game, Units Sold: 1\n",
      "----------------------------------------\n",
      "Category: Office Supplies\n",
      "  Product: Notebook, Units Sold: 1\n",
      "  Product: Printer, Units Sold: 1\n",
      "----------------------------------------\n",
      "Category: Sports & Outdoors\n",
      "  Product: Camping Lantern, Units Sold: 4\n",
      "  Product: Soccer Ball, Units Sold: 2\n",
      "----------------------------------------\n",
      "Category: Toys & Games\n",
      "  Product: Puzzle, Units Sold: 3\n",
      "  Product: Board Game, Units Sold: 1\n",
      "----------------------------------------\n"
     ]
    }
   ],
   "source": [
    "driver = GraphDatabase.driver(uri, auth=(username, password))\n",
    "\n",
    "def top_two_products_per_category(driver):\n",
    "    query = \"\"\"\n",
    "    MATCH (cat:Category)<-[:BELONGS_TO]-(p:Product)<-[:IS]-(oi:OrderedItem)<-[:CONTAINS]-(o:Order)\n",
    "    WITH cat, p, SUM(oi.ordered_quantity) AS totalsold\n",
    "    ORDER BY cat.category_type, totalsold DESC\n",
    "    WITH cat, COLLECT({productName: p.short_name, totalsold: totalsold}) AS productSales\n",
    "    RETURN cat.category_type AS Category, productSales[0..2] AS TopTwoProducts\n",
    "    ORDER BY Category\n",
    "    \"\"\"\n",
    "\n",
    "    with driver.session() as session:\n",
    "        results = session.run(query)\n",
    "        for record in results:\n",
    "            print(\"Category:\", record[\"Category\"])\n",
    "            for product in record[\"TopTwoProducts\"]:\n",
    "                print(f\"  Product: {product['productName']}, Units Sold: {product['totalsold']}\")\n",
    "# use - to bloack different sections/categories.\n",
    "            print(\"-\" * 40)\n",
    "\n",
    "top_two_products_per_category(driver)\n",
    "driver.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### This code cell is used for **deleting the database**. This is because sometimes I want to test my code, and see what is the interpretation of my code in the neo4j. But I need to empty the database before every test or otherwise there will be duplicate data. The following code can delete almost all data, which enables me checking my code."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "class Neo4jGraphModel:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "\n",
    "    def clear_all_data(self):\n",
    "        with self.driver.session() as session:\n",
    "            session.run(\"MATCH (n) DETACH DELETE n\")\n",
    "\n",
    "\n",
    "graph = Neo4jGraphModel(uri, username, password)\n",
    "graph.clear_all_data()\n",
    "graph.close()\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
